{
  "appId": "1081530898",
  "name": "The New Yorker",
  "seller": "Advance Magazine Publishers Inc.",
  "icon": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/17/40/8e/17408e58-e332-e40d-8cba-00bab7af65f6/AppIcon-0-0-1x_U007emarketing-0-10-0-85-220.png/512x512bb.jpg",
  "rating": 3.90811,
  "ratingCount": 7792,
  "genre": "News",
  "description": "The New Yorker app is your digital destination for in-depth reporting, political and cultural commentary, fiction, and humor from New Yorker staff writers and contributors around the world.\n\nStay up to date. \nRead or listen to top stories from your favorite writers, every day. Turn on notifications so you never miss an important story or your favorite topic. \n\nBe transported.\nNews and politics. Books and culture. Fiction and poetry. Discover rich storytelling and rigorous reporting that will sweep you away and introduce you to something new. \n\nGo about your day.\nWhen your hands are full, listen to featured stories read by world-class narrators. If you need a break, solve a crossword puzzle or Name Drop quiz, and flip through a nearly endless supply of cartoons. And, when you’re on the go, save stories to access them on any device, even offline.\n\nThe app is free to download. Subscribers receive unlimited access. Most current New Yorker subscribers have unlimited access to the app as part of their existing subscription. Subscribers with a print-only subscription may not have unlimited access. App subscribers have full access to the Web site, including the archive and most recent issue. Users who have trouble accessing stories can e-mail apps@newyorker.com for assistance. \n\nNon-subscribers may access the app by starting a free trial. A subscription costs $11.99 a month or $119.99 annually, and includes a 7-day free trial, after which it will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period. Account will be charged for renewal within 24 hours prior to the end of the current period and will state the cost of renewal. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.\n\nSubscriptions may be managed by the user, and auto-renewal may be turned off by updating the user’s App Store Subscription settings after purchase. Payment will be charged to iTunes account at confirmation of purchase.\n\nInformation about our Terms of Service & Privacy Policy can be found at http://www.condenast.com/privacy-policy.",
  "version": "11.2.2",
  "releaseDate": "2025-12-29T17:25:44Z",
  "savedAt": "2026-01-26T11:49:33.045Z"
}