{
  "updatedAt": "2026-01-25T10:49:22.943Z",
  "reviews": [
    {
      "text": "I haven’t had any issues with the app, but I wish it was easier to access old crosswords! I hate having to scroll so much when it could easily be filtered by complete/incomplete.",
      "title": "Hard to access old crosswords",
      "date": "2026-01-23T18:20:57-07:00",
      "user": "cusickmelanie",
      "version": "11.2.2",
      "rating": 4
    },
    {
      "text": "On the iPad, there is not a single improvement over the disabled app for the purpose of reading the magazine. Having been an exemplary app for a periodical it is now a somewhat chaotic jumble.  Count me disappointed.",
      "title": "Poor replacement for old app",
      "date": "2026-01-23T06:43:40-07:00",
      "user": "Mostly Concise",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "Hooray! Now with dark mode!",
      "title": "Dark Mode!",
      "date": "2026-01-21T14:43:24-07:00",
      "user": "Molingrad",
      "version": "11.2.2",
      "rating": 5
    },
    {
      "text": "WHY does the app take me to the web site rather than where I left off reading the magazine?! Also, images are often cut off, downloading is inconsistent, and signing in is difficult.  Why can’t the New Yorker get it right after all these years?",
      "title": "Frustrating",
      "date": "2026-01-21T06:21:58-07:00",
      "user": "Scoober Thrower",
      "version": "11.2.2",
      "rating": 2
    },
    {
      "text": "The app experience is smooth but if you want to listen to some of the audio essays/reporting that they feature, prepare for the most monotone, lifeless read by a computer generated voice. Really eerie sounding, especially when the article mentions AI while being read by AI. Just hire someone.",
      "title": "Great App But Really? AI Voices?",
      "date": "2026-01-19T21:48:24-07:00",
      "user": "arbymanxxx",
      "version": "11.2.2",
      "rating": 3
    },
    {
      "text": "Not intuitive at all.  Seems to use a logic only known to itself.   Extraordinarily disappointing.",
      "title": "Clunky",
      "date": "2026-01-19T05:58:38-07:00",
      "user": "flomomicmagle",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "No setting at top right or any support.  Cant find account info, or change font size.  Cannot find articles even when I type the exact title, etc.  Fire whoever built this app.",
      "title": "A horrible app, use browser!",
      "date": "2026-01-18T22:25:30-07:00",
      "user": "Pilotatukb",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "If you close the app for any reason, you can't resume reading where you left off.  You've got to REMEMBER what paragraph, in what article, in what issue you were reading and methodically scroll your way back.  Deplorable.",
      "title": "Impossibly arcane.",
      "date": "2026-01-17T07:21:53-07:00",
      "user": "Ed F., Philadelphia",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "Poor app",
      "title": "Great writing but the app doesn’t work well",
      "date": "2026-01-15T09:53:29-07:00",
      "user": "twcfyhjigtyi",
      "version": "11.2.2",
      "rating": 3
    },
    {
      "text": "The old app at least worked.  This one is slicker but doesn’t download the articles-except for the first two paragraphs and then just spins endlessly.  New Yorker needs to hire some real tech people.",
      "title": "Just spins and spins",
      "date": "2026-01-14T18:38:58-07:00",
      "user": "Cove32",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "Crossword puzzles don’t load, app just spins forever.",
      "title": "Crossword no?",
      "date": "2026-01-08T12:50:36-07:00",
      "user": "dfhjddfghikjdd",
      "version": "11.2.2",
      "rating": 2
    },
    {
      "text": "I signed up for a both digital and physical copy yearly subscription. Although this was my fault, I signed up with my home address instead of my college house address. After many trials and contacting chat bots, it is impossible to change my address. An extremely frustrating app to use.",
      "title": "Hard to Use",
      "date": "2026-01-05T20:48:16-07:00",
      "user": "Idkidikddjjsbaba",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "I realized I can actually read articles if I delete the app and just read them on my browser.",
      "title": "Fixed it!!!",
      "date": "2026-01-04T07:23:28-07:00",
      "user": "Ibexcvb",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "My downloaded issues are now apparently here, but how do I find them?",
      "title": "Where?",
      "date": "2026-01-03T17:27:18-07:00",
      "user": "toucana",
      "version": "11.2.2",
      "rating": 2
    },
    {
      "text": "Hard app to sign in and doesn’t give access I want to prior issues.",
      "title": "Hard to sign in",
      "date": "2026-01-03T09:06:03-07:00",
      "user": "DLP2515",
      "version": "11.2.2",
      "rating": 2
    },
    {
      "text": "The New Yorker is a catastrophically flawed app. It is often demoralizing and humiliating to consider that I pay $200 a year for a subscription to this nearly unusable service. It is plagued with a seemingly endless onslaught of annoying bugs - most consistently, whenever you close the app, it exits the article and does not save your place so you have to then find the article again and then find your place to take up where you left off. It also decides to sign you out of your account at least twice a week and force you to go through the bureaucratic horrors of logging in again (extra fun when you are on a plane or other places without cell service). Then there are lots of exciting little bugs that whimsically appear and disappear. Most recently, every article just turned into a blank, empty endless scroll with no words after about three sentences. It might be a conflict of interest but I do think the psychology of what keeps us coming back to this awful experience would be a great subject for Jia Tolentino‘s next piece.",
      "title": "Incredibly buggy, often unusable",
      "date": "2026-01-01T14:53:40-07:00",
      "user": "loooookas",
      "version": "11.2.2",
      "rating": 1
    },
    {
      "text": "I love reading from the magazine directly. It is exciting to turn pages but I love the accessibility of the phone so I can leave the magazine at home and read from my phone if ever I find myself waiting.",
      "title": "Not Just Another App",
      "date": "2025-12-31T09:37:33-07:00",
      "user": "MelonBliss",
      "version": "11.2.2",
      "rating": 5
    },
    {
      "text": "I know you have only had like 30 years to get a decent functional app, but maybe prioritize it now? Signs itself out randomly and makes it impossible to sign back  picture don’t align with the article titles in the list of articles in “current issue” I search short fiction then select a story and I get a completely random article. Repeatedly. Did someone hire his old college friend’s god son to develop this? I quit the app last year because the app was (hint not sap, not pap, but cr…yeah. (And there is a bit too much shallow pop culture stuff these days). But I missed it so in our modern wilderness and resubscribed this year. Still…. The app. The app! Onward and upward..\nI hope!",
      "title": "The app really needs work",
      "date": "2025-12-30T21:26:26-07:00",
      "user": "Lao bio",
      "version": "11.2.2",
      "rating": 3
    },
    {
      "text": "I would enjoy this mote if it ere not a battle to sign in and get recognized every time I try.  Other subscriptions recognize me from their app, and open up immediately.  New Yorker practically asks for my birth certificate and passport.  There is no reason for it to be this way.  It discourages me from using it.  Fortunately I have a print subscription also so that’s pretty much what I stick to.  New Yorker, come into the 21st century.",
      "title": "User unfriendly",
      "date": "2025-12-30T14:34:29-07:00",
      "user": "Esterdotter",
      "version": "11.2.2",
      "rating": 3
    },
    {
      "text": "I can’t find anywhere to email you from on the app and no place to sign in. SO FRUSTRATING!!!\nAnd, yeah, I haven’t been able to do your crossword puzzles for weeks.",
      "title": "Signing in, crossword puzzle",
      "date": "2025-12-28T18:01:27-07:00",
      "user": "beadist",
      "version": "11.2.1",
      "rating": 3
    },
    {
      "text": "How do you cancel a digital subscription? I don't have any option to cancel in Apple Settings Subscriptions",
      "title": "How do you cancel a digital subscription?",
      "date": "2025-12-28T06:08:49-07:00",
      "user": "iBigsell",
      "version": "11.2.1",
      "rating": 2
    },
    {
      "text": "It works well on an iPhone but doesn’t work at all on an iPad￼. The iPad app doesn’t always keep up with the contents of an issue. The cover is right but the contents are from a different week. As the New Yorker told me, in that case you have to delete the app and reinstall it from the App Store. It has worked the three or four times I’ve had the problem over the past year or so, but I would think someone would fix it.",
      "title": "Garbage, and not the first time.",
      "date": "2025-12-27T21:13:31-07:00",
      "user": "safetyinformation",
      "version": "11.2.1",
      "rating": 2
    },
    {
      "text": "Sticks out like a sore thumb on my home screen. Please add a dark mode icon so I don’t have to hide it.",
      "title": "Where is the Dark Mode icon?",
      "date": "2025-12-26T16:00:43-07:00",
      "user": "Kurt____",
      "version": "11.2.1",
      "rating": 2
    },
    {
      "text": "My wife pays this bill, and I’ve had log in difficulties. I got a page that only displayed pay or not pay options, not log in. Getting to the “settings “ page is awkward. It feels like they were too cheap to really test it out. I ended up hitting a button that had me buy another subscription. I called customer service and was told the new subscription might take 24-48 hours to post. I’ve invested an hour plus fiddling with . I hate the app, love the magazine.",
      "title": "Log in trouble",
      "date": "2025-12-24T06:00:18-07:00",
      "user": "Clyde Dobro",
      "version": "11.2.1",
      "rating": 2
    },
    {
      "text": "I struggled with accessing issues last year, was told it was the app, not my subscription. Then I tried again this yet because how hard can it be?  It is just access to print on an app. Well again I am not getting access to the printed material !",
      "title": "New Yorker",
      "date": "2025-12-20T15:25:00-07:00",
      "user": "KMTLCH",
      "version": "11.2.1",
      "rating": 3
    },
    {
      "text": "Why do I get embedded ads if I pay for the services? So annoying and ugly in the middle of reading something.",
      "title": "Paid Subscriber Ads\t??",
      "date": "2025-12-19T16:34:18-07:00",
      "user": "Carlosarloas",
      "version": "11.2.1",
      "rating": 3
    },
    {
      "text": "It’s just and endless series of things not working. Whoops, the crossword puzzles stopped updating so you can’t play today’s! Oops, you’re signed in, but we still won’t show content! Just burn this down and start over.",
      "title": "Love the New Yorker, the app is a hot mess",
      "date": "2025-12-17T13:40:06-07:00",
      "user": "DMV john",
      "version": "11.2.1",
      "rating": 2
    },
    {
      "text": "Crossword with partner mode is so buggy. Won’t sync, or does then suddenly stops. Very disappointing from a supposedly high quality operation.",
      "title": "Buggy!",
      "date": "2025-12-15T21:45:39-07:00",
      "user": "lui phui",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "I have an IPhone 15 pro max, full updated as of writing this. The app will take a long time to get to a log in screen, then after you log in the screen stays black and nothing will load. I can access the website just fine, log in and do my thing. But the app does not work. Disappointing to say the least. It’s 2025 and to have such a faulty app is surprising.",
      "title": "App does not work",
      "date": "2025-12-15T16:48:53-07:00",
      "user": "App won’t work 2025",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "Just won’t load.  I tried deleting and redownloading several times.  Never had this problem with an app begore.",
      "title": "Won’t load.",
      "date": "2025-12-15T16:06:01-07:00",
      "user": "TC288",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "Why do you you not update crosswords?\nPushing too many new games",
      "title": "Games",
      "date": "2025-12-15T15:47:52-07:00",
      "user": "BarLouMil",
      "version": "11.2.0",
      "rating": 2
    },
    {
      "text": "Search engine is terrible.  Even when it works, completely irrelevant results. Can’t even surface articles I know are there.",
      "title": "Great content hidden in terrible search",
      "date": "2025-12-15T14:43:09-07:00",
      "user": "BKSlope",
      "version": "11.2.0",
      "rating": 2
    },
    {
      "text": "Over the last couple of years I have repeatedly written to the New Yorker app to describe the endless difficulties with signing in, of being kicked off the app, of being told I had no subscription, of being forced to remove and re-download the app; the response is always some copy-and-paste nonsense that ignores the content of my pleas for help. It is ironic that a magazine famed for its writing has outsourced its app to illiterates.",
      "title": "the worst app on iPhone",
      "date": "2025-12-15T14:19:04-07:00",
      "user": "RASUWS",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "As many have said before, this app is junk. Slow, glitchy, and lacking basics like dark mode.",
      "title": "Slow and outdated",
      "date": "2025-12-15T13:44:43-07:00",
      "user": "Ktyyyyyy",
      "version": "11.2.0",
      "rating": 2
    },
    {
      "text": "The first time in ages that I really want to search for and then read a New Yorker article, and the app simply doesn’t work. Great writing, great reporting, easily one of the best magazines in the world, but it’s so disappointing that their technology is this substandard.",
      "title": "Enough monocle adjusting",
      "date": "2025-12-15T12:10:42-07:00",
      "user": "cmgnyc72",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "nothing but the games open, so annoying after paying for a subscription. just want to be able to read the articles",
      "title": "nothing works, blank pages",
      "date": "2025-12-14T22:01:49-07:00",
      "user": "Dance19741",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "On first install it took 10 minutes just to load the login screen. I tried logging in and gave up when the front page wouldn’t even load. Don’t bother with the app and use the website",
      "title": "Unusable",
      "date": "2025-12-14T19:17:20-07:00",
      "user": "Chi_Tau",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "This app leaves very much to be desired. I open it and then nothing. Really, just the spinning of icon or whatever you call it. This is why free trial is prudent. App is garbage and doesn’t make for an enjoyable reading experience. Fix it.",
      "title": "The wheel goes round…..",
      "date": "2025-12-14T18:41:19-07:00",
      "user": "Mjtboston",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "It almost never loads properly or remembers my subscription. What in the world is going on?",
      "title": "Great magazine horribly buggy app",
      "date": "2025-12-12T21:51:49-07:00",
      "user": "JDHoratioPhD",
      "version": "11.2.0",
      "rating": 2
    },
    {
      "text": "I just downloaded this app. I was looking forward to using it because it’s become harder to buy the magazine where I live and I can’t even download a magazine. It just keeps freezing. It just keeps saying that I try again. Try again luckily I’m on a free trial, I don’t think that I will be renewing it and I was really looking forward to this extremely unhappy.",
      "title": "very unsatisfied",
      "date": "2025-12-12T19:59:21-07:00",
      "user": "jcsmiley",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "Love the NYer but yikes, it's been weeks since I've been able to open this app. Deleted then reinstalled. Still doesn't work. Articles don't load and unable to get any support.",
      "title": "Please fix it!",
      "date": "2025-12-12T18:00:41-07:00",
      "user": "mbn1969",
      "version": "11.2.0",
      "rating": 2
    },
    {
      "text": "Great writing…. However, Can’t sign in easily and signs you out automatically. Get auto forwarded to 10 different log in pages. For this price should have top tier app.",
      "title": "Great content, trash UI",
      "date": "2025-12-12T17:54:27-07:00",
      "user": "Eeeereere1",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "This app functions properly maybe 10% of the time. The rest of the time it refuses to open links, tries to get me to pay for another membership claiming my current membership doesn’t work, and is just an exercise in frustration. If you write the support desk they respond many days later implying that you’re too stupid to use a phone, as if their bad product is your fault. I shouldn’t have to turn off my phone and turn it on again, or delete your app and reinstall it just to get a glorified web browser to work. Do better.",
      "title": "Love the writing, hate the app",
      "date": "2025-12-12T17:04:48-07:00",
      "user": "Thereader23",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "Brand new subscriber here, and content simply won’t load. Based on the bad reviews of the app that are out there, this is something that’s been going on a while. Nice to see there are some canned responses to these posts, but perhaps David Remnick should hire new devs?",
      "title": "Horrible…unusable",
      "date": "2025-12-12T16:33:23-07:00",
      "user": "NY City Guy",
      "version": "11.2.0",
      "rating": 1
    },
    {
      "text": "Why can’t the app just remember where I was reading and return me there when I reopen the app?   It aggressively sends me to the top page.  I constantly have to go to the history tab to get back to where I was before. Come on developers/marketers, you can do better.",
      "title": "Loses my place",
      "date": "2025-12-10T21:04:05-07:00",
      "user": "mr.brain",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Please fix the app. I’ve attempted reinstalling, rebooting, restarting several times and nothing helps. I just renewed my subscription and was hoping to have easy access to this magazine online. FAIL",
      "title": "Can’t sign-in app",
      "date": "2025-12-10T08:20:33-07:00",
      "user": "Barramo",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Can’t access mag. Hangs.",
      "title": "Horrible App",
      "date": "2025-12-08T22:36:13-07:00",
      "user": "MBWSF",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "the app is not working after the update",
      "title": "app not working at the moment",
      "date": "2025-12-08T21:34:19-07:00",
      "user": "eeduard00888",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "I’m a subscriber and I can’t get past the loading screen. I already uninstalled and reinstalled (before doing this, I was stuck in an empty app)\n\nPretty crazy for an app that is just meant to load articles?",
      "title": "Broken",
      "date": "2025-12-08T21:30:29-07:00",
      "user": "F. Gcg",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Everything else about the app is working fine.  Will try reinstall.",
      "title": "Trouble with Search and Listen",
      "date": "2025-12-08T20:09:33-07:00",
      "user": "CellularDoor80",
      "version": "11.1.0",
      "rating": 5
    },
    {
      "text": "I am consistently having a hard time signing in. I only pay for online so that makes getting a full use of my subscription challenging.",
      "title": "Hard time signing in",
      "date": "2025-12-08T19:36:41-07:00",
      "user": "JRC2683",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "I’ve tried deleting the app and reinstalling it, turning the phone on and off, and nothing will jar it off of some article from August 2025. I’m signed in and paid up. Not sure what the problem is but I feel like I’m wasting my money",
      "title": "App is stuck I can’t download anything",
      "date": "2025-12-08T19:23:40-07:00",
      "user": "Qwertyyuo",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Love the content. Wish the app would load, but it never does.",
      "title": "Won't load",
      "date": "2025-12-08T19:20:35-07:00",
      "user": "simmsbrooks",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "The app is poor. It constantly freezes, losses downloaded data, or is otherwise not user friendly. It’s a shame.",
      "title": "App is Unusable",
      "date": "2025-12-08T19:14:36-07:00",
      "user": "LHHA6087",
      "version": "11.1.0",
      "rating": 2
    },
    {
      "text": "Very erratic app. Right now, I have a blank “Top Stories” tab, so nothing is loaded.  It has worked in the past, but not consistently.",
      "title": "Nothing Loads",
      "date": "2025-12-08T16:48:16-07:00",
      "user": "BummedSteve",
      "version": "11.1.0",
      "rating": 2
    },
    {
      "text": "Maybe the worst performing app of all time. Everyone involved should be banned for life from computers",
      "title": "Boy does this stink",
      "date": "2025-12-08T15:23:34-07:00",
      "user": "rhekfnejbf",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "but this app is so glitchy!\n\nmy biggest problem is the search function, which doesn’t turn up results based on relevance. example: say i search the name “jane doe” - it seems the programming will search for “jane” and “doe” instead of “jane doe” and then the search results are sorted by date instead of relevance, and inundated with any mention of “jane” or “doe”, and the “jane doe” i’m looking for is totally buried. \n\nfor others frustrated by this, i’ve come up with a slightly more effective workaround: i search only the most specific word that i think is related to what i’m trying to find. like if i know the jane doe article is about spelunking i just search “spelunking” and hope for the best. otherwise i just google “jane doe new yorker” and immediately find what i’m looking for, try to open the article in the app, the app is glitchy and can’t open it for me. \n\noh but how i do love reading the new yorker",
      "title": "i love the new yorker",
      "date": "2025-12-04T11:14:30-07:00",
      "user": "fishkix",
      "version": "11.1.0",
      "rating": 3
    },
    {
      "text": "This app won’t load my keyboard for the crossword. Please fix",
      "title": "Crossword",
      "date": "2025-12-03T19:14:37-07:00",
      "user": "bensan1965",
      "version": "11.1.0",
      "rating": 2
    },
    {
      "text": "Finally the app is once again keeping track of where you left off in an article. This is so much better than a month ago. \n\nUnfortunately when i click on the Magazine icon, the app closes, so the only way to get to the Magazine is to do a search and scroll down to Magazine issues.",
      "title": "Keeping article place again",
      "date": "2025-12-02T16:01:47-07:00",
      "user": "Curvyball",
      "version": "11.1.0",
      "rating": 4
    },
    {
      "text": "This app is nearly unusable.  Very difficult to stay logged in, basic navigation is impossible to decipher.  Condé Nast has never been good at apps, and they keep getting worse.  Love the magazine, but essentially there is no useful online version.  Not recommended.",
      "title": "Unusable app",
      "date": "2025-12-01T19:49:14-07:00",
      "user": "JimBTR",
      "version": "11.1.0",
      "rating": 2
    },
    {
      "text": "I have a subscription. The app is constantly asking me to subscribe. I sign in but I still cannot access content.",
      "title": "Dysfunctional app",
      "date": "2025-11-28T11:36:45-07:00",
      "user": "Semiskeptic",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "This app is useless if you want to do the crossword puzzles. It doesn’t have any way to save a game so you don’t know what you completed.\nThe app is very difficult to navigate. It seems they ran out of money when it came to a site designer.",
      "title": "Bad App",
      "date": "2025-11-27T12:17:19-07:00",
      "user": "Patusa99",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Cannot load crossword puzzle.",
      "title": "Lousy App",
      "date": "2025-11-27T08:29:55-07:00",
      "user": "Beach_Life_71",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Ever since you changed the app, I have had nothing but trouble. I can’t download any issues to read, I open the app and just look at a blank white screen, your top stories don’t load. What am I paying for?",
      "title": "why can’t you fix the app",
      "date": "2025-11-24T21:47:46-07:00",
      "user": "AW Gator",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Never loads.  Worst of all my media apps. Just awful.",
      "title": "Worst of all my media apps.",
      "date": "2025-11-24T20:35:23-07:00",
      "user": "SonomaPelvic",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "It has stopped delivering new editions.   After deleting and reinstalling the app won’t get past the first screen.  Very disappointing.",
      "title": "Not working properly",
      "date": "2025-11-24T19:06:22-07:00",
      "user": "AppTester1959",
      "version": "11.1.0",
      "rating": 3
    },
    {
      "text": "This app is useless. Articles won’t load on iPad. How has this not been addressed? For the price the subscription costs, this is ridiculous.",
      "title": "Issues won’t load",
      "date": "2025-11-24T19:04:24-07:00",
      "user": "Hazel the dog",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "I’ve used this app for years but since updating to IOS 26, only the top two keyboard rows show, breaking all the puzzles. Please fix!",
      "title": "Crossword doesn’t work on iPhone SE",
      "date": "2025-11-24T18:56:23-07:00",
      "user": "VillageRobin",
      "version": "11.1.0",
      "rating": 3
    },
    {
      "text": "This app works poorly. The design seems intended to sell you things and promote advertising rather than giving you digital access to the print magazine. Navigation is clunky. Downloading slow or non functional. Truly not at the level one would expect from the New Yorker.",
      "title": "Poor design, worse execution",
      "date": "2025-11-24T15:06:42-07:00",
      "user": "Lobachevskii",
      "version": "11.1.0",
      "rating": 2
    },
    {
      "text": "This App doesn’t load a single article…",
      "title": "Nothing works",
      "date": "2025-11-24T12:23:57-07:00",
      "user": "Bostonuser2017",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "App consistently logs me out so I need to log in every time I want to access content. Further, I can’t access any audio content at this time. As someone with limited vision, it is extremely frustrating that I am paying for a paper and digital subscription, and can’t access the audio recordings. Do better, The New Yorker.",
      "title": "Dysfunctional app",
      "date": "2025-11-24T11:24:06-07:00",
      "user": "tbtbtac",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "Worst app for a magazine/media company I’ve ever come across. \n\nRegularly doesn’t recognize my account, saved articles not accessible offline, search useless. \n\nAs a decades-long subscriber to the print NYer, I have to wonder if this thing was built  by luddites who wanted people to avoid online reading.",
      "title": "User Hostile",
      "date": "2025-11-24T11:19:48-07:00",
      "user": "gmesserian",
      "version": "11.1.0",
      "rating": 1
    },
    {
      "text": "This app is terrible to use - it constantly logs me out mid-article and says it can’t find my subscription, even when I try multiple ways of logging in (password, the subscriber number on my print subscription. I’ve been a paid subscriber for 10+ years at this point and am always annoyed with this app",
      "title": "Impossibly buggy, issues linking to subscriptions",
      "date": "2025-11-23T13:08:42-07:00",
      "user": "Daily Chao",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "I have subscribed to the New Yorker for decades. This review is not about the magazine, but about the app. The iPad app just does not load! I did everything I could to speed up my iPad, but the problem does not seem to be the iPad but the app. There is a new article that I really, really want to read and I cannot get it to load.  The app slowly, slowly got to the menus. That took forever. And now it won’t go past that.",
      "title": "so slow as to be useless",
      "date": "2025-11-22T20:32:22-07:00",
      "user": "Nvh9",
      "version": "11.0.3",
      "rating": 3
    },
    {
      "text": "I have tried every recommended solution and no matter what I do the app will never get past the loading screen. Went online to look for answers and see folks with same issue THIRTEEN YEARS AGO. If they havent figured it out in 13 years I dont think they ever will.",
      "title": "Useless on ipad",
      "date": "2025-11-22T18:57:33-07:00",
      "user": "AdnamaMc",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "Current update on my app isn’t loading a single article!!",
      "title": "No articles loading",
      "date": "2025-11-22T14:15:29-07:00",
      "user": "Finno123",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "Not sure what’s up with this app, but when I do a search, all I get is gray screen and a spinning wheel. Help!",
      "title": "Wonky and slow",
      "date": "2025-11-22T13:56:11-07:00",
      "user": "Solituny",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "The new New Yorker app is a mess. There is no log-in link anywhere and it continually blocks access to the home page with a pop-up screen telling you to subscribe even if you already do so. Condé Nast should be able to do better when they’re chatting over $100 for a digital subscription. Bring back the old, superior app!",
      "title": "Needs a log-in link",
      "date": "2025-11-22T13:03:31-07:00",
      "user": "Noctambulate",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "The app is extremely inconsistent in terms of which tabs I’ll be able to access. I was really into the podcast and the audio tab stopped working one day. I deleted and reinstalled the app and still no luck. This is frustrating",
      "title": "Not able to access",
      "date": "2025-11-22T12:28:44-07:00",
      "user": "asksjd",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "The new app won’t load. The ball just spins and spins. Frustrating.",
      "title": "Won’t load",
      "date": "2025-11-22T11:28:00-07:00",
      "user": "A listener32",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "Asks repeatedly for me to sign in then says you’re already signed in. Articles don’t load, circle just spins and spins. Why has this not been fixed by now?",
      "title": "Terrible app",
      "date": "2025-11-22T11:07:26-07:00",
      "user": "Stevemiller57",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "The audio feature is so terrible to use.  Downloaded content won’t play.  Easily the most difficult listening app in its category.  Just a shoddy product.",
      "title": "Why is it so hard to listen ?",
      "date": "2025-11-20T08:28:00-07:00",
      "user": "Mikafino",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "I can’t read articles or view downloaded issues while traveling in Mexico because the cell service here is so bad that I have no or extremely slow internet. App also keeps asking me to restore my Apple purchase, which isn’t possible because that requires internet as well. Works fine on wifi. Very frustrating. Possibly related to new features in iOS 26.",
      "title": "Does not work without an internet connection",
      "date": "2025-11-17T18:41:58-07:00",
      "user": "Prisoner65864",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "Terrible log in system and interface generally. Credential caching non functional. How can this be so poorly executed when its only goal is presenting you text and static images?",
      "title": "Terrible interface",
      "date": "2025-11-16T19:12:11-07:00",
      "user": "AmpersandPitchfork",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "It’s a shame such a prestige magazine has such a lousy app. Same constant sign-in issues and bugs others have complained about, and now crosswords won’t load, just an endlessly spinning screen. Spend some of your subscribers’ money on this and do better.",
      "title": "Not New Yorker worthy",
      "date": "2025-11-15T20:49:56-07:00",
      "user": "citybeagle",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "I pay a fortune for this magazine and the app, and it can't remember that I AM A SUBSCRIBER and sends me to the stupid website to \"sign in\" to read or do the crosswords on both phone and iPad. If it were possible I would rate ZERO stars. Like many readers I have been a SUBSCRIBER for *decades* but I am so sick of hassling with this app...it  even shows my correct email address and that my subscription is active, but apparently THAT'S NOT ENOUGH.",
      "title": "WHY can't this app remember subscribers?",
      "date": "2025-11-13T17:50:58-07:00",
      "user": "iona 6",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "Big fan of the magazine, despise everything Condenast touches. Get it together; I’m tired of paying and not being able to access because of authentication issues",
      "title": "Condenast Authentication is a Constant Pain",
      "date": "2025-11-13T13:51:26-07:00",
      "user": "10395820104730102",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "Brutal UI- as if you don’t want us to sign into our own subscription. And single subscription at CN- only the NYM.  And not a techno neophyte.  Awful and stupid.",
      "title": "Sign in, how?",
      "date": "2025-11-12T19:56:09-07:00",
      "user": "lolopuff",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "I expect when I pay over $100 a year in subscription fees that I’m not going to hear ads and yet your content is full of ads for your own stuff. That makes no sense. Every other podcast subscription that I pay for or new sub subscription that I pay for doesn’t play ads so your pricing is ridiculous.",
      "title": "Why pay for the subscription???",
      "date": "2025-11-12T10:16:14-07:00",
      "user": "Koda Tay",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "Harder to navigate, less clear browsing. But the worst is how buggy the crossword is. I used to do the crossword every single day! Now, not only is it not an every day thing anymore, but the app acts really weird. When I ‘tab’ to the next word, sometimes it skips words and takes me to one a few entries later. Sometimes it inexplicably places the cursor in the middle of a word even when I haven’t gotten earlier letters. It’s really frustrating.",
      "title": "It’s gotten worse since I last used it",
      "date": "2025-11-12T04:30:13-07:00",
      "user": "sadrans",
      "version": "11.0.3",
      "rating": 3
    },
    {
      "text": "Can never sign in to read anything Print mag subscriber",
      "title": "Same problem",
      "date": "2025-11-11T19:52:47-07:00",
      "user": "angry minnow",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "Love the magazine, wait for it weekly.  But the functionality on my iPad is lacking.  How to I access “Cover Story”, where’s the link, week to week? Also, the captions for magazine cartoons aretiny and often illegible or blocked by other data on the screen. I’m referring to swiping at the link for “Cartoons from the issue.”  Finally, paging from one article to the next requires to reach the bottom of the current article. Is there a way to just swipe right or left no matter where you are at an article? Please address all this.",
      "title": "Lousy iPad functionality",
      "date": "2025-11-11T09:21:17-07:00",
      "user": "jj_vv_jj",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "I do not like this app - sign in is a nightmare, if fan of podcast, audio - it’s terrible. Disappointing that In the Dark Podcast - the best in audio journalism is unfortunately on worse app for audio. Billed a billion times still have no way of listening to In the Dark on Apple Podcast App. Is it Apple Podcast App great - no - but it’s a least audio app - this app is not audio app - sign in loop. Not even interested in new season of In the Dark - but to lose seasons 1, 2 and 3 - terrible.",
      "title": "Really Bad App",
      "date": "2025-11-10T13:01:04-07:00",
      "user": "ADD Vices",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "Why?",
      "title": "The app takes so long to open?",
      "date": "2025-11-09T21:14:47-07:00",
      "user": "Akdop",
      "version": "11.0.3",
      "rating": 3
    },
    {
      "text": "I love the New Yorker, I love the stories and use the app all the time but I have two major gripes. You cannot search for things at all. I’m not sure the search feature is even enabled but if there is I know it doesn’t work well! Secondly, I am horribly offended when you use AI readings for the audio story. The New Yorker should pay voice actors. Not only is it an infinitely better user experience, replacing actors with robots feels pretty clearly  antithetical to the New Yorkers purpose of celebrating and spreading the work of artists. Human ones.",
      "title": "Please make the app better",
      "date": "2025-11-09T13:52:06-07:00",
      "user": "micc1234",
      "version": "11.0.3",
      "rating": 3
    },
    {
      "text": "The UX/UI has been on a harsh decline. Please consider the user.",
      "title": "What happened?",
      "date": "2025-11-09T12:30:42-07:00",
      "user": "Amphoteres",
      "version": "11.0.3",
      "rating": 3
    },
    {
      "text": "Terrible for iPad. Laggy and glitchy, constantly. Constantly telling me I’m not signed in, or that I don’t have a subscription at all, etc. Bring back the kindle subscription, or at least price the hard copy more reasonably if you can’t make a decent app. Also, I don’t need moving graphics inside the articles (nobody does). This is the New Yorker, not BuzzFeed.",
      "title": "Terrible for iPad.",
      "date": "2025-11-09T05:41:35-07:00",
      "user": "MoJoe7",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "With the recent update it doesn’t allow you to play crossword in landscape mode and see your keyboard anymore. It only pops up with portrait. My iPad cover was built to use in landscape and I used to be able to play the game and loved it. BRING BACK LANDSCAPE WITH THE ABILITY FOR THE KEYBOARD TO POP UP WHEN YOUN IN A BOX TO WRITE THE WORD!",
      "title": "Landscape Mode Removed",
      "date": "2025-11-08T07:14:12-07:00",
      "user": "ADJUSER",
      "version": "11.0.3",
      "rating": 2
    },
    {
      "text": "Type in the search bar the name of an author who you know has published a short story in NY. Then spend the rest of your morning scrolling through irrelevant hits never finding the sought-after story.",
      "title": "Search function? Ha",
      "date": "2025-11-08T02:40:50-07:00",
      "user": "Unhapoy reader",
      "version": "11.0.3",
      "rating": 1
    },
    {
      "text": "Why remove the cryptic crosswords?",
      "title": "Why remove the cryptic crosswords?",
      "date": "2025-11-04T04:59:32-07:00",
      "user": "ILikePuzzles31415",
      "version": "11.0.2",
      "rating": 1
    },
    {
      "text": "I don’t know who thought of this change, but I can’t find anything any more.  If they don’t fix this I’ll have to cancel my subscription.",
      "title": "Lost",
      "date": "2025-10-31T17:14:53-07:00",
      "user": "Haydn88",
      "version": "11.0.2",
      "rating": 1
    },
    {
      "text": "The keyboard is cut off on my iPhone SE screen. I used to be able to access the whole keyboard but something changed about a month again and I haven’t been able to access the bottom half of the keyboard since then",
      "title": "Crosswords",
      "date": "2025-10-29T20:23:12-07:00",
      "user": "Climate Ian",
      "version": "11.0.2",
      "rating": 2
    },
    {
      "text": "Reloads constantly , can’t back out of app and go back to where you were reading , have to read entire article or scroll all the way back multiple times, poorly thought out and will be cancelling.\n\nEdit: This issue seems to be resolved now on iOS 26.1 RC",
      "title": "Garbage",
      "date": "2025-10-29T13:41:15-07:00",
      "user": "Jselmz",
      "version": "11.0.2",
      "rating": 3
    },
    {
      "text": "I love the New Yorker and the app! I’ve been using it for a few years without any major problems. The only issue is with some of the newer updates and “The Latest” section that recently was introduced on the mobile app. I find that it never updates to the most recent when you click “All latest stories” and if I refresh that specific page to see them, it says there is no internet connection which I know isn’t true because I have no issue with any other part of the app or with my phones connectivity in general. I love this app and magazine and just wish that part could be fixed so I don’t have to use my laptop to see if there’s any distal stories I’ve missed",
      "title": "The Latest Bug",
      "date": "2025-10-29T05:30:19-07:00",
      "user": "Jlfkys",
      "version": "11.0.2",
      "rating": 4
    },
    {
      "text": "I like to use .7-8 speed in evening to slow down the mind. Only options .5 or 1. available. Disappointing!",
      "title": "Audio speed",
      "date": "2025-10-28T20:42:49-07:00",
      "user": "seriouslyenteranickname",
      "version": "11.0.2",
      "rating": 3
    },
    {
      "text": "Please make it possible to change the font from within the app. I find the default font size very small when compared to my Mac text size, and to make it normally sized I have to change the entire mac’s text size until it’s ridiculously large. This seems like an easy fix - just allow us to change text size from within the app itself. Thanks.",
      "title": "Font size",
      "date": "2025-10-28T09:24:25-07:00",
      "user": "Nelson_Carroway",
      "version": "11.0.2",
      "rating": 2
    },
    {
      "text": "This problem has become much worse recently, to the point where the app is becoming unusable.\n\nAny given article will load the initial content, then “pause” with a spinning wheel & nothing further no matter how long I wait.\n\nI have restarted the iPad, deleted/reinstalled the app, and cleared more iPad storage space - nothing works.  \n\nAs a very longtime New Yorker subscriber I find this frustrating as I must either delete the app and go browser-only, or wait for the print edition to arrive in the post …. Like I used to circa 2002 or so.",
      "title": "Articles only partially loading on iPad",
      "date": "2025-10-27T12:14:53-07:00",
      "user": "LemanSole",
      "version": "11.0.2",
      "rating": 3
    },
    {
      "text": "Love that they added dark mode",
      "title": "Great!",
      "date": "2025-10-26T23:10:54-07:00",
      "user": "Deetz_415",
      "version": "11.0.2",
      "rating": 5
    },
    {
      "text": "The crossword puzzles will not load. When you choose a puzzle it takes you to the load screen and all you get is the constant loading circle. It never loads! I have deleted, reinstalled, logged out & back in. None solved the issue.",
      "title": "Crosswords stopped loading",
      "date": "2025-10-26T20:19:31-07:00",
      "user": "M.F.F.L.",
      "version": "11.0.2",
      "rating": 2
    },
    {
      "text": "Love The New Yorker.  Longtime subscriber.  It’s 2025… we need DARK MODE.",
      "title": "Needs Dark Mode",
      "date": "2025-10-26T20:03:20-07:00",
      "user": "Baby baby drc",
      "version": "11.0.2",
      "rating": 4
    },
    {
      "text": "Was dark mode introduced so that it can mask the captions on the cartoons? That seems to be the primary impact. Why are making it so hard to read the cartoons in the print format?\nWhy are you masking the captions on cartoons with the black border?\nThank you for fixing the captions. White on black is much easier to read than black on black.",
      "title": "Lack of functions",
      "date": "2025-10-26T15:22:08-07:00",
      "user": "BSchnee1806",
      "version": "11.0.2",
      "rating": 3
    },
    {
      "text": "The app totally stopped working for me one day, after loading slowly for many weeks. I completely uninstalled it, then reinstalled and signed back in. Now it seems to be working fine.",
      "title": "Reinstalled after it stopped working",
      "date": "2025-10-25T05:43:56-07:00",
      "user": "Benwathefreeman14",
      "version": "11.0.2",
      "rating": 3
    },
    {
      "text": "The app is only good for reading a current issue. You cannot use it to search for previous  content even if you have the article title and author name.. Worse is that if you download issues, you can’t read them if you’re not online. So you can’t read the issues while traveling or just offline.",
      "title": "Minimal and lacking functionality,",
      "date": "2025-10-24T00:34:47-07:00",
      "user": "transeme",
      "version": "11.0.1",
      "rating": 2
    },
    {
      "text": "There should be a way to turn off the “cute” flashing graphics, which makes it difficult or impossible to focus on the print. In a magazine supposedly devoted to quality writing, why are the graphic designers trying to prevent readers from enjoying reading or comprehending the actual text, which is supposed to be the point of the magazine. Regular features such as the new books section are impossible to read because of the distracting flashing graphics.",
      "title": "Annoying moving graphics",
      "date": "2025-10-23T10:56:41-07:00",
      "user": "Havelock310",
      "version": "11.0.1",
      "rating": 2
    },
    {
      "text": "The app no longer saves my place in an article, it just reverts to the beginning.",
      "title": "Won’t keep my place since update",
      "date": "2025-10-22T17:55:15-07:00",
      "user": "JmeKc416",
      "version": "11.0.1",
      "rating": 3
    },
    {
      "text": "I primarily use the app to access the cartoons in the expansive archive of past issues. However, this app has yet to figure out how to handle the captions that go either the art. Recently, all captions in past issues are blocked out entirely by a black strip that covers them completely. Such a small thing; but one that is causing me to drop my subscription. A shame really. The cartoonists work so hard and the tech side sabotages it all.",
      "title": "Recurring problems with cartoons",
      "date": "2025-10-22T10:33:58-07:00",
      "user": "lpsguy",
      "version": "11.0.1",
      "rating": 2
    },
    {
      "text": "I can’t find a “Settings” menu within the app.",
      "title": "Can’t turn off dark mode or adjust font size from within app on iPad",
      "date": "2025-10-22T09:47:47-07:00",
      "user": "NPR Fanaticus",
      "version": "11.0.1",
      "rating": 3
    },
    {
      "text": "Update: unbelievable, they added dark mode in 2025, finally! Now if only it would stop freezing",
      "title": "No dark mode??? Really??? [updated]",
      "date": "2025-10-22T06:32:44-07:00",
      "user": "PolishBR",
      "version": "11.0.1",
      "rating": 2
    },
    {
      "text": "Best podcast ever !!!!!\nThanks guys you are more than incredible! \nYou are beyond wonderful!",
      "title": "Best podcast!",
      "date": "2025-10-21T18:37:41-07:00",
      "user": "mtpianist",
      "version": "11.0.0",
      "rating": 5
    },
    {
      "text": "The app is harder than most to understand how to sign in. The cartoon captions are written into a dark band at the bottom sith small type. The last issue, they wer not readable.",
      "title": "Difficulties with cartoon captions",
      "date": "2025-10-20T16:37:12-07:00",
      "user": "Jheckel",
      "version": "11.0.0",
      "rating": 3
    },
    {
      "text": "There were significant problems recently with this app: difficult sign in interface, account not recognized, articles displaying as a few inches of text followed by blank page. Briefly, these issues were resolved, but now they are back. Why is this so difficult? The app worked fine until a few weeks ago.",
      "title": "MISERY!!",
      "date": "2025-10-20T05:40:57-07:00",
      "user": "Janglophone",
      "version": "11.0.0",
      "rating": 1
    },
    {
      "text": "My wife and I have a shared print subscription and app access is through her email and password.  The app is perennially seeing my email and denying access to me, and then only offering me the opportunity to subscribe rather than to sign in.  Love the content, hate this feature.",
      "title": "Firewall Problems",
      "date": "2025-10-20T04:29:02-07:00",
      "user": "Brooklynite from Heights",
      "version": "11.0.0",
      "rating": 2
    },
    {
      "text": "I love the app, but it's impossible to log into the app on my Lenovo tablet. I am constantly sent back to the login page and can never access my account. I want to read the articles on my tablet but it's impossible to login.",
      "title": "Unable to Login",
      "date": "2025-10-19T12:36:33-07:00",
      "user": "AMDC2013",
      "version": "11.0.0",
      "rating": 2
    },
    {
      "text": "I have subscribed to the magazine not only to read the weekly editions but also to research their large archives. Unfortunately, the engine is increasingly deficient and since it does not offer any filter, most research will produce a long list of unrelated articles. Try Octavio Paz for example.",
      "title": "Research engine deficient",
      "date": "2025-10-19T08:29:58-07:00",
      "user": "Trapicheiro",
      "version": "11.0.0",
      "rating": 3
    },
    {
      "text": "Same login issues.i am just trying to figure out whether this acct is under my name or my husbands.  I keep being asked to log in different ways.  We only have a digital subscription.  \nI also wanted to find out how I pay for it.   I have the app on my iPad and iPhone but it isn’t working well on the iPad.  It does not need an update.",
      "title": "Complex login procedures",
      "date": "2025-10-18T14:19:05-07:00",
      "user": "even this app is a problem",
      "version": "11.0.0",
      "rating": 3
    },
    {
      "text": "Love the magazine, love the app. One issue is that the bottom row of the keyboard doesn’t show in the crossword. You can’t push the page up/scroll down to go to the bottom. So that’s quite frustrating.",
      "title": "Keyboard?",
      "date": "2025-10-18T12:59:02-07:00",
      "user": "keep it movin",
      "version": "11.0.0",
      "rating": 4
    },
    {
      "text": "Sign in is impossible. You cannot manage your account in the app. It takes you to a customer care website that won’t let you sign in. I wanted to upgrade my account and spend more money. Now I feel so angry I want to cancel my account and never spend another dollar on this magazine. I’m sure they are doing this on purpose to make canceling harder, but you will not stop me canceling. I WILL find a way to cancel, and I will never buy The New Yorker again. I feel like an idiot for downloading this in the first place. Greedy company",
      "title": "Impossible to manage account",
      "date": "2025-10-18T09:40:04-07:00",
      "user": "Smithers65",
      "version": "11.0.0",
      "rating": 2
    },
    {
      "text": "It appears that most of the audio stories are generated using automated voice now. This wasn’t the case some time ago, when fewer audio articles were produced but all by human narrators. Ideally I hope you can make all articles read by human, but if that’s too costly, could you at least label which articles are read by human? It is a shame to have great writings ruined by flawed automated voices.",
      "title": "Automated audio???",
      "date": "2025-10-17T20:15:04-07:00",
      "user": "ym4201",
      "version": "11.0.0",
      "rating": 2
    },
    {
      "text": "I’ve loved the New Yorker app for years. But the recent update means it no longer saves your place in an article when you close your phone or switch to another app. It’s very frustrating to have to find where you left off over and over.",
      "title": "Saving place in article",
      "date": "2025-10-17T18:27:26-07:00",
      "user": "arty podcast lover",
      "version": "11.0.0",
      "rating": 5
    },
    {
      "text": "I always prefer reading the print magazine but it’s handy to have another way to read the latest articles when you don’t have the print issue on hand. Only thing that’s missing is a dark mode as I find that it makes it much easier to read for extended periods of time.\n\nUpdate: Dark mode is a thing now!",
      "title": "Good way to read on the go",
      "date": "2025-10-17T16:45:59-07:00",
      "user": "Marius Maximus 88",
      "version": "11.0.0",
      "rating": 5
    },
    {
      "text": "Subscriber for years but the app just doesn’t recognize me. VERY poor quality app",
      "title": "Signing In",
      "date": "2025-10-17T08:23:15-07:00",
      "user": "Fgutdddtyu",
      "version": "11.0.0",
      "rating": 4
    },
    {
      "text": "Love the new yorker from its artful media to its written content - just a sublime experience. But it’s a little funky that the app doesn’t have a night mode!",
      "title": "Wonderful Magazine with Mostly Wonderful App",
      "date": "2025-10-16T23:08:19-07:00",
      "user": "ANCCP",
      "version": "11.0.0",
      "rating": 5
    },
    {
      "text": "Like others, I can’t sign in. On computer web browser, it shows my email and says I have an active subscription. After a recent app update on phone, it shows the same email and insists “Subscription not found”.  It’s maddening, and interactions with condenast.com are completely confusing. 2 stars because I simply can’t access or figure out how to fix it.",
      "title": "Fine… if I could sign in",
      "date": "2025-10-16T17:21:32-07:00",
      "user": "PQuincy2008",
      "version": "11.0.0",
      "rating": 2
    },
    {
      "text": "Now “[t]he audio player is not able to read this data.”",
      "title": "Forced to Update App",
      "date": "2025-10-16T16:47:24-07:00",
      "user": "dadburned",
      "version": "11.0.0",
      "rating": 1
    },
    {
      "text": "Thank you for adding Dark Mode support!!!",
      "title": "Wonderful",
      "date": "2025-10-16T13:59:32-07:00",
      "user": "NickLMart",
      "version": "11.0.0",
      "rating": 5
    },
    {
      "text": "Is there no way for a couple to share a digital subscription? Since you’ve done away with password sign-in, every time I want to read an article I need to have my wife send me a one-time code. At +$100 for a subscription, this is absurd. And finding a way to get help on your app or website seems impossible.",
      "title": "Absurdly difficult",
      "date": "2025-10-16T07:45:08-07:00",
      "user": "Trob888",
      "version": "11.0.0",
      "rating": 1
    },
    {
      "text": "Audio almost all automated voices mispronouncing everything. App can’t stay signed in. Just so this properly, New Yorker.",
      "title": "Lousy App",
      "date": "2025-10-16T06:43:30-07:00",
      "user": "dordr",
      "version": "11.0.0",
      "rating": 1
    },
    {
      "text": "Finally and thank you!",
      "title": "Dark mode!",
      "date": "2025-10-16T04:28:02-07:00",
      "user": "Nyt users",
      "version": "11.0.0",
      "rating": 5
    },
    {
      "text": "The New Yorker is renowned for fact checking and copy editing. To make your audio offerings commensurate, please hire human readers. The AI voice can’t figure out how to Matthiessen, Styron or Proust. It detracts. It’s inaccurate.",
      "title": "Audio needs fact checking",
      "date": "2025-10-14T17:33:08-07:00",
      "user": "Imogen s",
      "version": "10.8.3",
      "rating": 1
    },
    {
      "text": "Always getting locked out, needing to sign in, get passcodes and multiple verifications, sheesh. It’s not worth it. About to unsubscribe after 25 years",
      "title": "Always needing to sign in!",
      "date": "2025-10-13T14:33:09-07:00",
      "user": "PapayaCrab",
      "version": "10.8.3",
      "rating": 1
    },
    {
      "text": "The New Yorker app continues to decline in functionality. It is even more difficult now to access the magazine. And if you are in the middle of reading an article, the app constantly brings you back to the home screen. Then you have to go find what you were reading again. And finally, the app constantly loses your subscription so you have to sign in or verify your subscription multiple times a week. Still love the magazine. Hate the app.",
      "title": "App getting worse",
      "date": "2025-10-12T13:09:59-07:00",
      "user": "ncb11111111",
      "version": "10.8.3",
      "rating": 2
    },
    {
      "text": "The New Yorker publishes some of the finest long form  journalism, poetry and fiction available. Their previous version of the app made it easy to read one’s way through the content without ever losing one’s place. This placeholder function is especially crucial since many of The New Yorkers pieces are too long to finish in one sitting. The current version of the app defaults to open on a splash screen for the latest issue. So if you want to continue reading what you were reading earlier, you have to click on “all issues” scroll down the list of all issues, find the issue you were reading, scroll through the issue to find the article you were reading and open it. Thankfully the app does remember where in the story you stopped, but the extra work required to resume reading feels weirdly punitive.",
      "title": "Best content worst “upgrade”",
      "date": "2025-10-12T10:04:36-07:00",
      "user": "5mattering",
      "version": "10.8.3",
      "rating": 3
    },
    {
      "text": "Dark mode is so much easier on the eyes. Get with the Times! (And every other news app)",
      "title": "No dark mode",
      "date": "2025-10-11T21:41:51-07:00",
      "user": "IcebergSpoonCat",
      "version": "10.8.3",
      "rating": 1
    },
    {
      "text": "I have been a print subscriber for years.  I have frequently had problems with the digital apps recognizing my subscription and this new app is no exception.  The new app keeps asking me to subscribe, but does not give me the opportunity to input my subscription information. It seems to tie to my Apple ID, not realizing that some of us don,t use our Apple ID for everything. I set up my New Yorker digital access before Apple IDs existed. Very very frustrating.",
      "title": "Does not recognize subscription",
      "date": "2025-10-09T04:13:13-07:00",
      "user": "rgb8585",
      "version": "10.8.3",
      "rating": 2
    },
    {
      "text": "Update: the newest version has fixed the issue! \n\nArticles don’t load properly - just the first screen loads, but when you scroll down, the rest is blank. Have deleted and reinstalled several times with no effect. Hopefully an update fixes this issue, but as of right now, I can only read articles from my browser.",
      "title": "Currently unusable (update: it works again)",
      "date": "2025-10-09T01:33:25-07:00",
      "user": "P_joey",
      "version": "10.8.3",
      "rating": 4
    },
    {
      "text": "Cannot read downloaded magazines if you are offline because it can’t find active subscription. Extremely annoying design flaw. Please fix. The whole point of the app is to be able to read magazine anytime and anywhere. Apparently not, only if you are connected to the internet.",
      "title": "Useless app for offline reading",
      "date": "2025-10-08T17:43:17-07:00",
      "user": "Slovenski bralec v tujini",
      "version": "10.8.3",
      "rating": 1
    },
    {
      "text": "They changed the way the crosswords work on the app and it’s super buggy and they refuse to acknowledge that it’s their update. It’s such a bummer as this was on of the biggest things I did on the app.",
      "title": "Crosswords are ruined",
      "date": "2025-10-06T19:57:01-07:00",
      "user": "Kparsley25",
      "version": "10.8.2",
      "rating": 2
    },
    {
      "text": "I used to be able to do The NYer crosswords in the app. The puzzle would open fully on my phone screen with a QWERTY keyboard at the bottom. Now all of a sudden, when the crossword opens, it’s way too big for the screen. I tried adjusting the font size in Settings on my phone, but it made no difference. Customer Care could not help. I’m disappointed because the crosswords were clever and fun.",
      "title": "Crosswords suddenly stopped working",
      "date": "2025-10-04T08:34:06-07:00",
      "user": "Shelley in NYC",
      "version": "10.8.2",
      "rating": 4
    },
    {
      "text": "It’s 2025.  Where is the dark mode?  Every other app has it, and this one is primarily text only!   Help, please!",
      "title": "DARK MODE",
      "date": "2025-10-03T20:51:00-07:00",
      "user": "87JLSA",
      "version": "10.8.1",
      "rating": 3
    },
    {
      "text": "You can “download” issues, but you can’t access them offline. On a plane or on the road where internet is spotty, it’s worthless. \nI’m not interested in choosing individual articles to add to my “library”; I want the magazine I subscribed to. \nIt’s worse than maddening!!!",
      "title": "Doesn’t Work Offline",
      "date": "2025-10-03T14:07:28-07:00",
      "user": "JAZ5E",
      "version": "10.8.1",
      "rating": 1
    },
    {
      "text": "I’m a subscriber but this week only the first three or four lines are visible for each piece in the magazine. What up with that??",
      "title": "Current glitch",
      "date": "2025-10-02T15:23:00-07:00",
      "user": "Hairybeast212",
      "version": "10.8.1",
      "rating": 2
    },
    {
      "text": "Can the New Yorker please improve the offline capacity of this app!!! It’s too expensive to not work off line. It consistently tells me my subscription cannot be found. I am out of service and off line frequently and it’s very frustrating. Please improve this app!!!",
      "title": "Doesn’t work offline",
      "date": "2025-10-02T11:50:13-07:00",
      "user": "maui_bee",
      "version": "10.8.1",
      "rating": 3
    },
    {
      "text": "Just terrible app. Stories won’t load. No tech support. Works on desktop but app for phone and tablet won’t.",
      "title": "Stories will not completely load",
      "date": "2025-10-01T23:31:23-07:00",
      "user": "?56/9",
      "version": "10.8.1",
      "rating": 1
    },
    {
      "text": "Just updated the app and now I can’t do the crosswords, which has previously been my favorite app feature! Now when I open a puzzle, the bottom row of the keyboard is below the bottom edge of my screen, and the page does not scroll - so I can’t access the letters in the bottom row, which makes doing the crossword impossible. I’m using an iPhone 8, which is an older model, but I’m running iOS 16. The app is supposed to work on iOS 14 or later.",
      "title": "Can’t do crosswords in latest version!",
      "date": "2025-10-01T22:06:14-07:00",
      "user": "MH Philadelphia",
      "version": "10.8.1",
      "rating": 2
    },
    {
      "text": "Great magazine, very poor App. Have had constant problems for many years.\nIt works for a while and then it screws up. It’s poor Service for such excellent journalism.",
      "title": "Buggy, buggy, buggy",
      "date": "2025-09-30T06:31:15-07:00",
      "user": "A disgruntled professor",
      "version": "10.8.1",
      "rating": 3
    },
    {
      "text": "I honestly have never had more trouble signing in to an App than I have on this one. It constantly boots me out and just doesn’t seem to want to stay linked to my subscription. It is so irritating!!",
      "title": "Love the content, hate the app",
      "date": "2025-09-29T18:16:48-07:00",
      "user": "Tpetrovna",
      "version": "10.8.1",
      "rating": 3
    },
    {
      "text": "Crosswords are unplayable on IPhone SE. Keyboard does not fully display",
      "title": "Poorly optimized for IPhone SE",
      "date": "2025-09-29T15:05:48-07:00",
      "user": "Bell145",
      "version": "10.8.1",
      "rating": 1
    },
    {
      "text": "Holy smokes - it’s not that hard.  I’d like to access my downloaded content on an airplane when I don’t have connectivity.  The app keeps saying that I don’t have an active subscription in this condition and then DOES NOT LET ME access my account.  Figure it out.  It appears to not be difficult for others (looking at you Netflix, NY Times….uh….pretty much everything else)",
      "title": "How about getting your offline act together?!",
      "date": "2025-09-29T12:50:49-07:00",
      "user": "honorekennedy",
      "version": "10.8.1",
      "rating": 1
    },
    {
      "text": "A recent update completely broke the crossword. The keyboard no longer fits on the screen, so I can't get to the bottom two rows.",
      "title": "Broke the crossword",
      "date": "2025-09-29T09:50:32-07:00",
      "user": "Larry Campbell",
      "version": "10.8.1",
      "rating": 2
    },
    {
      "text": "I like the New Yorker app’s layout, however it constantly signs me out of my account, and it’s a pain to sign back in. I don’t have this problem with any other apps.",
      "title": "Good app but signs you out",
      "date": "2025-09-28T06:26:52-07:00",
      "user": "DanKenny17",
      "version": "10.8.1",
      "rating": 3
    },
    {
      "text": "Managing my account has proven nearly impossible. The subscription has paused multiple times despite an active subscription. Customer support on the app is non existent. Please fix these bugs!",
      "title": "Miserable performance",
      "date": "2025-09-28T06:12:51-07:00",
      "user": "Abbott North",
      "version": "10.8.1",
      "rating": 1
    },
    {
      "text": "Hi, \n\nI am writing to the New Yorker digital editors.  \n\nThank you for the app, we use it a lot especially the audibles for my husband who has become blind.  We enjoy the games especially the crossword puzzles. \n\nHowever, since the new version , I have lost my history of crosswords which I use to gauge how well I’m doing: speed , etc.  is there a way to get back my history?  \n\nAlso, what happened to poetry?  We miss the poems.  \n\n It was difficulty finding where to write you re our comments. One seems to need a map or categories for type of stories.\n\nBest regards",
      "title": "Questions / suggestions",
      "date": "2025-09-27T05:10:11-07:00",
      "user": "Avaarl",
      "version": "10.8.1",
      "rating": 5
    },
    {
      "text": "The update 3 days ago and I now can’t play any crossword puzzles.  Keyboard never appears.  I emailed and called and customer service is incompetent.  So I canceled my subscription",
      "title": "Last update broke puzzles",
      "date": "2025-09-26T11:26:21-07:00",
      "user": "Heidi11576",
      "version": "10.8.1",
      "rating": 1
    },
    {
      "text": "Inability to stream the audio version of New Yorker articles one after another, as was possible on Audum before the New Yorker Times killed it, is a major shortcoming.  Apparently this would be too logical. 🙄",
      "title": "OK app but…",
      "date": "2025-09-25T20:14:02-07:00",
      "user": "Bodhishanti",
      "version": "10.8.1",
      "rating": 2
    },
    {
      "text": "Sometimes surprising. Almost always interesting and well worth the read.",
      "title": "Love the content",
      "date": "2025-09-21T15:09:59-07:00",
      "user": "Cath chalfant",
      "version": "10.8.0",
      "rating": 5
    },
    {
      "text": "The replica app is much more friendly and easier to read and use. Please stop removing it. New app hard to see, difficult to use, often has sign in problems.",
      "title": "Old app much better",
      "date": "2025-09-21T12:59:58-07:00",
      "user": "NewYorkerMagReview",
      "version": "10.8.0",
      "rating": 1
    },
    {
      "text": "It keeps telling me I don’t have a subscription.   I download issues and they are gone next time I try to read them.",
      "title": "Absolutely terrible",
      "date": "2025-09-20T10:39:21-07:00",
      "user": "Ventry80",
      "version": "10.8.0",
      "rating": 1
    },
    {
      "text": "I love the content but over the years I have found it very difficult to access. I just spent the last 20 minutes trying to sign in and changing my password, only to be signed out and again prompted to pay for a subscription. Meanwhile I am being billed monthly for a subscription I can barely access. Please get your sign in process act together. I don’t want to have to cancel, but the frustration makes it hard to justify paying $120 a year for something I can’t easily use.",
      "title": "Very hard to sign in",
      "date": "2025-09-18T12:17:50-07:00",
      "user": "Calliexw",
      "version": "10.8.0",
      "rating": 4
    },
    {
      "text": "You publish a superb magazine. To help assist in audience capture, please consider adding dark mode to your application…for the youth, the weary-eyed, and everyone in between.",
      "title": "Sublime Enrichment",
      "date": "2025-09-18T10:40:07-07:00",
      "user": "lizofthenorth",
      "version": "10.8.0",
      "rating": 5
    },
    {
      "text": "I like the content and I pay for it so I can read and enjoy it, but this app is so clunky and often needs to be restarted and is super glitchy",
      "title": "Buggy app!!",
      "date": "2025-09-17T22:18:46-07:00",
      "user": "jennwritesreviews",
      "version": "10.8.0",
      "rating": 1
    },
    {
      "text": "The application constantly forgets my login and tells me that I don't have a subscription (I do). If I open it after a while to read while I'm somewhere with no internet access like on an airplane, I can forget about actually being able to read any of my saved articles or anything in the latest issue. Just a horrible user experience and I'll probably cancel my subscription to the print version.",
      "title": "Great magazine, awful app",
      "date": "2025-09-17T11:56:17-07:00",
      "user": "IlliniRob86",
      "version": "10.8.0",
      "rating": 1
    },
    {
      "text": "There are so many aesthetic issues with the iPad app that I could discuss, but I’m going to focus on the worthless search function. The only way to find an old article is to search on the website then click open in… Unfortunately the iPad and iPhone apps no longer sync anything, so if you save an article to your library on one, you’ll also have to search on the web on the other device and open in there also. You charge an insane amount annually for a subscription—these are table stakes. Please hire a new app design/coding team. It’s gotten ridiculous.",
      "title": "Search function useless",
      "date": "2025-09-16T16:53:57-07:00",
      "user": "nellysisgone",
      "version": "10.8.0",
      "rating": 3
    },
    {
      "text": "Every time I open the app I get a screen that says \"Subscription not found\" with my account email displayed. Then I go to settings and reverify my already logged-in account and it recognizes my subscription. Customer Support has said months ago this would be fixed soon but I’m still waiting. I’ve decided to let my subscription lapse and will just read through Apple News.",
      "title": "Get subscription verification that works",
      "date": "2025-09-15T15:06:00-07:00",
      "user": "Cantabuio",
      "version": "10.7.9",
      "rating": 1
    },
    {
      "text": "Seriously, is there some reason they need to be microscopic? MAKE THEM BIG ENOUGH TO READ!",
      "title": "One star off for tiny cartoon captions",
      "date": "2025-09-14T19:37:19-07:00",
      "user": "confusedbankuser",
      "version": "10.7.9",
      "rating": 4
    },
    {
      "text": "Have more issues with this app than any other on my iPad. I just want to read the magazine but I seem to encounter an issue every single time. Stop being cute with the design of the app and please just make the magazine load.",
      "title": "Buggy",
      "date": "2025-09-11T18:53:51-07:00",
      "user": "wigster133",
      "version": "10.7.9",
      "rating": 1
    },
    {
      "text": "This app does not respect iPhone dark mode settings, yet it uses the text size set in system settings.  Why the inconsistency?",
      "title": "Content is great. App is meh.",
      "date": "2025-09-10T17:41:38-07:00",
      "user": "AlyssaG888",
      "version": "10.7.9",
      "rating": 3
    },
    {
      "text": "App works ok, but extremely limited in features. Worst omission is the lack of Dark Mode, which makes reading in darker lighting settings an awful experience.",
      "title": "No Dark Mode",
      "date": "2025-09-06T18:43:31-07:00",
      "user": "UnitedSpeed",
      "version": "10.7.8",
      "rating": 1
    },
    {
      "text": "The app is a ramshackle, shoddy piece of software.",
      "title": "Incredible content delivered through a mediocre app",
      "date": "2025-09-05T20:09:09-07:00",
      "user": "Redjellydonut",
      "version": "10.7.8",
      "rating": 1
    },
    {
      "text": "When it works, it’s great. But there are enough bugs to make it more frustrating than useful. The worst one is getting signed out and told you don’t have a subscription. Which leads to sign in errors and getting stuck in a loop of being directed to sign up for a new subscription. It’s usually just easier and more predictable to use the web version.",
      "title": "Buggy and login errors",
      "date": "2025-09-05T09:45:03-07:00",
      "user": "ChildeRowland",
      "version": "10.7.8",
      "rating": 2
    },
    {
      "text": "Spend some money on a decent programmer.  The magazine is great.  The app is terrible.",
      "title": "Terrible Programming",
      "date": "2025-09-04T07:02:16-07:00",
      "user": "Cameraman Joe",
      "version": "10.7.8",
      "rating": 1
    },
    {
      "text": "The reading experience of actual articles  in this app, both phone and iPad is very good. But there are some annoying issues that need addressed. One is that it constantly signs you out. Even though I read it every day, I am often met with a ‘Subscription not found’ error message forcing me to log back in. Second is the search function. It is sometimes impossible to find a story, and one is required to go to google, search it there and then have the browser open in the app. A third is that it selects the main page stories for you, but there is no simple way to see stories in order of publication so it becomes very easy to miss stories, particularly online-only ones. Finally, unlike other apps, the sections are too broad.  So, for instance, all culture is lumped instead of dividing by medium. A reader looking specifically for film stories would want to find both features and reviews on cinema, but there is no such ordering in this app. I don’t mean to be super harsh because the reading experience itself is good, but you would hope the app of such an expensive magazine would be less glitchy in account management and more useful in navigation of content.",
      "title": "Well designed but with annoying tics",
      "date": "2025-08-31T13:06:08-07:00",
      "user": "Nachosp",
      "version": "10.7.8",
      "rating": 2
    },
    {
      "text": "Well, the title says it all. Completely opaque process, telling you that you are logged in, so please log in. Badly integrated with Condé Nast, too. How can they make it so bad?.",
      "title": "Worst login ever",
      "date": "2025-08-30T10:50:07-07:00",
      "user": "Bilco nick",
      "version": "10.7.8",
      "rating": 1
    },
    {
      "text": "This app is hijacked by Condé Nast’s and one or the other keeps kicking me out repeatedly over and over. I’ve spent hours fighting with these apps. Way to make a 40 year veteran die hard fan 2mm shy of canceling forever. Good work Condé Nast.",
      "title": "Ridiculous",
      "date": "2025-08-30T01:22:58-07:00",
      "user": "aliris19",
      "version": "10.7.8",
      "rating": 1
    },
    {
      "text": "I paid for a one year subscription, installed the app, opened it, logged in, completely blank of content. \nCall me. I can rebuild your app so it’s friendly, easy, and a joy to use. Your current one doesn’t even function. Your “engineers” are frauds.",
      "title": "App is empty",
      "date": "2025-08-29T16:48:58-07:00",
      "user": "pmalon",
      "version": "10.7.8",
      "rating": 1
    },
    {
      "text": "I find it quite difficult to sign in at CondéNast.",
      "title": "App difficulty",
      "date": "2025-08-29T05:28:38-07:00",
      "user": "Lodovicius",
      "version": "10.7.8",
      "rating": 2
    },
    {
      "text": "The constant issues with the app not refreshing, logging out and freezing on trying to download issues or look back at other downloaded issues has made this app not usable and will be cancelling subscription because of this. Disappointing to have such a poorly functioning app despite hours of redownloads and troubleshooting. Waste of time when I finally have a moment to read and it’s wasted dealing with a faulty buggy app",
      "title": "Please fix",
      "date": "2025-08-28T18:59:58-07:00",
      "user": "Rheanna Mae",
      "version": "10.7.7",
      "rating": 1
    },
    {
      "text": "New Yorker is my favorite and lately the only daily publication I read to see the news of the day.  It is also source of learning something entirely new to me.",
      "title": "The best of the best!",
      "date": "2025-08-26T20:33:57-07:00",
      "user": "tata@#1",
      "version": "10.7.6",
      "rating": 5
    },
    {
      "text": "Have had great difficulties with Condé Nast web strategies",
      "title": "Bad web management",
      "date": "2025-08-25T23:54:24-07:00",
      "user": "vfehiihb",
      "version": "10.7.6",
      "rating": 1
    },
    {
      "text": "I’m a long time subscriber and have the app. It continually logs me out over and over. I spend more time trying to login than reading articles I want to read. I love the New Yorker but the app is shabby, at best.",
      "title": "The worst app",
      "date": "2025-08-21T17:34:13-07:00",
      "user": "FirstPlaceGang",
      "version": "10.7.6",
      "rating": 1
    },
    {
      "text": "Inexcusably bad for a publication of this caliber to have an app that doesn't cut it. The app is slow, provides no feedback after clicks, freezes often, won't load articles or play audio. It is difficult to search and I am considering ending my subscription.",
      "title": "Buggy and laggy",
      "date": "2025-08-19T14:50:57-07:00",
      "user": "HaydenClevenger",
      "version": "10.7.6",
      "rating": 2
    },
    {
      "text": "I am so tired of this app logging me out repeatedly despite being a paid subscriber. It is incredibly frustrating to have to login over and over again.  I did some online research and discovered that this is a long-standing problem that the New Yorker does not seem to have been able to solve over many years.   I have not run into this problem with other apps.  For such a quality magazine, this is inexplicable.   Please fix!!! 🙏🙏",
      "title": "Worst App Ever!",
      "date": "2025-08-18T19:53:10-07:00",
      "user": "I❤️SD",
      "version": "10.7.6",
      "rating": 1
    },
    {
      "text": "This app as well as other Conde Nast apps have repeatedly shut me out saying I had no account, when I did via Appke.  There was mo obvious way to fix, though I finally got in today by deleting the app and data, re-installing, and navigating luckily through some unclear screens.\n\nFix this.  I'm going to be very reluctant to pick up any subscriptions for a while.",
      "title": "Very easily gets confused about accounts",
      "date": "2025-08-18T05:37:49-07:00",
      "user": "jdsimonoff",
      "version": "10.7.6",
      "rating": 1
    },
    {
      "text": "Seriously. What did you do?  It has been unusable since July.",
      "title": "Ugggghhhhh!",
      "date": "2025-08-16T09:09:22-07:00",
      "user": "mmnwmn",
      "version": "10.7.6",
      "rating": 1
    },
    {
      "text": "Takes your money for a digital prescription, but gives you nothing.  Looking at the reviews lately, it’s not just me - they know they’re ripping us off, and can’t be bothered to fix it. \n\nOh yeah, and their super-friendly responses here to contact customer service?  They ask for info from your your mailing label to verify your account - after already being told that it’s a digital only subscription, so no mailing labels exist. Just another trick to keep your money and give you nothing in return.",
      "title": "Scam",
      "date": "2025-08-15T02:23:02-07:00",
      "user": "tgggyuvcdrgbgdfhj",
      "version": "10.7.6",
      "rating": 1
    },
    {
      "text": "Terrible buggy app. Over the years I have spent HOURS with customer service about it. Just renewed for $97. The app says “can’t find your subscription”. So many problems., so much frustration. Before it was not able to get audio like the New Yorker Radio Hour and other problems. Condé Nast and the New Yorker are HANDS OFF with this third party app. I’ve asked for a refund and canceled. I suggest getting the digital magazine directly through the New Yorker website. Maybe that will work better.",
      "title": "Good magazine, buggy, annoying app.",
      "date": "2025-08-12T10:45:20-07:00",
      "user": "Annoyed reader 2",
      "version": "10.7.6",
      "rating": 1
    },
    {
      "text": "Often this app does not work, fails to recognize my legitimate subscription. Im on a trip where app is needed.",
      "title": "Disappointed subscriber.",
      "date": "2025-08-11T12:27:17-07:00",
      "user": "Kes1961",
      "version": "10.7.5",
      "rating": 1
    },
    {
      "text": "I used to enjoy the app.  But after an app update in June, my user experience is now one of total frustration, e.g., many more clicks required, no consistent linking between written and audio version of the same article, poor search function. It's really a mess. And what may be even worse is the magazine didn't show any interest in hearing my feedback.",
      "title": "Recent app changes are terrible",
      "date": "2025-08-11T12:13:06-07:00",
      "user": "dcpops23",
      "version": "10.7.5",
      "rating": 1
    },
    {
      "text": "This on an iPad mini 7 IOS 18.6\n\nNew Yorker app auto play overrides audio of other apps playing in background. Do this-stream some music from Apple Music or Spotify. Open the New Yorker app. Music continues playing. Open an article. Music continues playing. Go back to New Yorker default page. Music stops. Repeatable. Also hi jacks audio from streaming web pages. First rule of app design-do no harm to other apps.",
      "title": "App hijacks audio from other apps",
      "date": "2025-08-08T06:57:01-07:00",
      "user": "berndtvon",
      "version": "10.7.5",
      "rating": 2
    },
    {
      "text": "H destroyed several plane flights. The issues that I have paid for, in fact all issues, disappear the instant you're not connected to the Internet. Go through a tunnel in a car, It will disconnect you from issues you own and have paid for. It is unfathomably annoying and stupid and evil",
      "title": "Steals your issues.",
      "date": "2025-08-06T21:49:18-07:00",
      "user": "Internet Genie",
      "version": "10.7.5",
      "rating": 1
    },
    {
      "text": "Suddenly the app has started to present gigantic images, with no cartoon captions, and no story text.  Uninstalled it, and will stick with my browser, which offers a much better experience than the app did even when it was working.",
      "title": "Doesn’t work on latest MacOS",
      "date": "2025-08-06T08:36:39-07:00",
      "user": "Jim_From_New_York",
      "version": "10.7.5",
      "rating": 1
    },
    {
      "text": "Condé Naste forgets I have a subscription every time I log in. Booooo",
      "title": "Magazine great, app stinks",
      "date": "2025-08-05T05:28:30-07:00",
      "user": "Beckfurde",
      "version": "10.7.5",
      "rating": 1
    },
    {
      "text": "PLEase make a dark reader mode, I’d read so much more!!!",
      "title": "Really need a dark mode",
      "date": "2025-08-05T01:31:05-07:00",
      "user": "kort123456789",
      "version": "10.7.5",
      "rating": 3
    },
    {
      "text": "I’ve been subscribing for 5 plus years.  Love the content.  But consistent login and subscription issues all while having paid has me in the brink of saying screw them",
      "title": "Content, yes! App, horrible",
      "date": "2025-08-02T12:07:48-07:00",
      "user": "Denver side 253",
      "version": "10.7.4",
      "rating": 1
    },
    {
      "text": "The app continually blocks me from reading, saying that I don’t have an active subscription. I canceled my New Yorker subscription — there’s no point in paying when I can’t even access it.",
      "title": "App is so bad that I canceled my subscription",
      "date": "2025-08-02T02:23:47-07:00",
      "user": "Sbp354",
      "version": "10.7.4",
      "rating": 1
    },
    {
      "text": "The app is truly dreadful. More often than not, I open the app to finish an article that I’m in the middle of, or to download the new issue, and I’m told there’s no subscription. I have subscribed continuously to the New Yorker for more than 50 years. They have youngsters updating the app, people who clearly do not read the magazine, possibly do not know how to read at all. It is one of the mysteries of life, why the New Yorker can’t get its act together.",
      "title": "Zero stars",
      "date": "2025-08-01T08:38:06-07:00",
      "user": "David NYC UWS",
      "version": "10.7.4",
      "rating": 1
    },
    {
      "text": "I bought a year subscription to the New Yorker through Apple, but can’t access it. The Conde Naste overlay seems to prevent me from logging in. I’ve called the New Yorker twice, which told me I had to take it up with Apple, which is impossible. Meanwhile, I have not had access to the magazine for months. I will not renew.",
      "title": "Don’t subscribe on Apple",
      "date": "2025-07-29T03:55:39-07:00",
      "user": "Games.rate",
      "version": "10.7.4",
      "rating": 1
    },
    {
      "text": "I regularly get bounced out of this app. A message erroneously reads that my subscription is not current. I have spoken to customer service numerous times and the problem only gets resolved temporarily before it happens again. This never happens with any other subscription. Luckily I get the print edition as well.",
      "title": "Worst app in the history of the internet.",
      "date": "2025-07-26T09:22:29-07:00",
      "user": "Nom de Dieu!",
      "version": "10.7.3",
      "rating": 1
    },
    {
      "text": "Difficult to open. Sometimes doesn’t open at all.",
      "title": "Terrible app",
      "date": "2025-07-25T20:35:02-07:00",
      "user": "Sgordet",
      "version": "10.7.3",
      "rating": 2
    },
    {
      "text": "The app will not load the home page or any New Yorker content for me. Either by opening the app directly or from the daily email links I receive as a subscriber. I deleted and reloaded app from Apple App Store, no improvement. New Yorker is essentially scamming me and other victims by taking subscription dollars and not providing any access to the contracted-for product.",
      "title": "The app is non functional",
      "date": "2025-07-25T20:16:01-07:00",
      "user": "GDS964",
      "version": "10.7.3",
      "rating": 1
    },
    {
      "text": "The app is stuck in the loading screen every. Every time I open it so I have to the use the web version. Unusable:(",
      "title": "Not loading",
      "date": "2025-07-25T18:52:32-07:00",
      "user": "ptvlex",
      "version": "10.7.3",
      "rating": 3
    },
    {
      "text": "The app just straight up doesn’t work. All of the sections are incredibly slow, it they even work at all. Granted, I have an older iPhone SE (2020)… but still. That’s no excuse.",
      "title": "A shame",
      "date": "2025-07-25T15:36:16-07:00",
      "user": "Benjamin Worcester",
      "version": "10.7.3",
      "rating": 1
    },
    {
      "text": "I purchased a subscription and the app continues to kick me out and when I try to log into website to sign in again it seems to recognize my account, but the app does not recognize it.",
      "title": "App subscription not found",
      "date": "2025-07-24T10:02:48-07:00",
      "user": "Becca Nicole 22",
      "version": "10.7.3",
      "rating": 1
    },
    {
      "text": "Enjoy the reading experience, if I can access it. This app will not reliably keep me logged in to my subscription. And now it refuses to recognize my subscription even though logging into the site indicates it is active. What good is an app you can’t use. What a joke.",
      "title": "Great app, terrible login and account management",
      "date": "2025-07-23T19:28:07-07:00",
      "user": "uberstar",
      "version": "10.7.3",
      "rating": 2
    },
    {
      "text": "Once again an update to the app has essentially made it nonfunctional",
      "title": "Once Again",
      "date": "2025-07-23T15:35:28-07:00",
      "user": "Bob Reno",
      "version": "10.7.3",
      "rating": 1
    },
    {
      "text": "I grew up reading my mom‘s copies of The New Yorker. Before I could actually understand most I always loved the fiction and reading the comics. I would look forward to every new issue and as I got older, I started reading things that I was curious about and it was the first magazine that opened my eyes to the world. More so than Cosmo or other girly magazines that had sex and boyfriend quizzes that I wasn’t taking because when I was 16 I didn’t have many boyfriends. Bravo New Yorker for a brilliant 100 years! I can’t wait for the festival in October!!!",
      "title": "Lifetime Reader",
      "date": "2025-07-23T11:58:45-07:00",
      "user": "ThePassenger444",
      "version": "10.7.3",
      "rating": 5
    },
    {
      "text": "Everything about this experience would be wonderful if this app wasn’t so terrible. And it is. It’s so terrible that I am writing a review of it. I would never do such a thing if it worked anything like well. But it does not. I’m not going to go into any detail because I’m not going to wrack my brain. It needs to be completely redone.",
      "title": "Terrible app, great content",
      "date": "2025-07-22T19:48:33-07:00",
      "user": "Cattle Sod",
      "version": "10.7.2",
      "rating": 1
    },
    {
      "text": "Frustrating that many articles will not play despite being listed in the listen section.\nNothing happens when you hit play.",
      "title": "Archive Section will not play",
      "date": "2025-07-21T05:17:59-07:00",
      "user": "Fredduff",
      "version": "10.7.2",
      "rating": 1
    },
    {
      "text": "One of the most annoying apps I have ever had.  Have a terrible time getting it to recognize my subscription, and have a terrible time getting to the magazine and archives.",
      "title": "Nuisance",
      "date": "2025-07-20T07:41:04-07:00",
      "user": "elfmor",
      "version": "10.7.2",
      "rating": 1
    },
    {
      "text": "I love having access digitally, but the app is infuriating with how often it logs me out. And for some reason, linking my physical subscription will not work. It is absurd that an app for a publication of this quality and prestige is so ridiculously fragile that it apparently cannot communicate with the subscription database and also is so paranoid that it needs to lock itself down at the drop of a hat. There is not one single reason that a subscriber’s account should need to be signed in to in this multi-step and arcane manner, multiple times a week, no less. If your aim is to get people to stick with reading the physical magazine, it would be better to not have the app at all, because then at least we would not be mad about it.",
      "title": "Great when it deigns to allow access",
      "date": "2025-07-18T21:16:16-07:00",
      "user": "Pufferfish02",
      "version": "10.7.2",
      "rating": 2
    },
    {
      "text": "Like others, I kept having problem accessing articles on The New Yorker app. I repeatedly get the message saying that my email account doesn’t have a subscription, even though the account payment record indicates that I’ve paid for my online subscription. I ended up reading the articles on my laptop. Using the app is just too frustrating.",
      "title": "“You are not a subscriber”",
      "date": "2025-07-18T09:04:02-07:00",
      "user": "bemarcopolo",
      "version": "10.7.2",
      "rating": 1
    },
    {
      "text": "The app does not recognize that my subscription is current and up to date.",
      "title": "App",
      "date": "2025-07-17T18:51:37-07:00",
      "user": "Msrha",
      "version": "10.7.2",
      "rating": 1
    },
    {
      "text": "Frustratingly few of the articles are available for listening, which is my preferred medium. Given that an automated voice is doing the reading, I don’t see why every single article isn’t available in this format.",
      "title": "Needs more audio options",
      "date": "2025-07-17T14:05:22-07:00",
      "user": "Martatius",
      "version": "10.7.2",
      "rating": 3
    },
    {
      "text": "Constantly signs me out. Opening the app I have to sign in, every time, then to read a story I have to sign in again. Just incompetent.",
      "title": "Nice layout, poor function",
      "date": "2025-07-16T21:04:35-07:00",
      "user": "Constant Reader Jr.",
      "version": "10.7.2",
      "rating": 1
    },
    {
      "text": "My iPhone 6s, iOS 15.8.4, crashes on app start. I see the splash screen, then the app closes. Yes an old phone but was working until recent update. App Store indicates it should still work. ** Update: issue fixed on latest app release, thanks!",
      "title": "Crashing",
      "date": "2025-07-16T06:34:08-07:00",
      "user": "rich4:3",
      "version": "10.7.2",
      "rating": 5
    },
    {
      "text": "This app would be so much better if every time I opened it I wouldn’t have to log in, multiple times. \nAlso, opening the app on my IPhone or IPad and then clicking on something to read, only to have it take me to the New Yorker webpage, where I have to log in (again), before getting redirected is a PITA. \nI get it, these are “white people problems” but, if you’re charging a substantial amount for a subscription than the in app experience should be smooth and seamless, preferably with no ads and very similar to how it would feel if I were reading an actual digital magazine and not an website pretending to be a digital magazine.\nNamaste.",
      "title": "Pretty clunky",
      "date": "2025-07-15T20:01:32-07:00",
      "user": "bigsloth",
      "version": "10.7.2",
      "rating": 3
    },
    {
      "text": "I’ve tried to cancel after my free trial but if you try, the app will glitch and not allow you to go to the screen. I’ve contacted their support and they still have not cancelled my subscription. Scam!!!",
      "title": "Will not let you cancel subscription!!!!",
      "date": "2025-07-12T08:10:58-07:00",
      "user": "app simply does not work",
      "version": "10.7.1",
      "rating": 5
    },
    {
      "text": "This mobile app is nigh unusable. Frequently logs me out, never plays audio, no way to open articles from safari on the app.\n\nCompared to other publications' mobile apps, this is embarrassing.",
      "title": "Good publication. Terrible mobile app",
      "date": "2025-07-11T19:08:22-07:00",
      "user": "doineedausername",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "I like to listen to articles while working, but it’s really clunky. The stories regardless of having a strong connection don’t play a lot of the time making only some of the content actually available to me. I wish I could listen without feeling like it’s hit or miss.",
      "title": "Glitches a lot",
      "date": "2025-07-09T10:07:31-07:00",
      "user": "Aimee :)",
      "version": "10.7.1",
      "rating": 2
    },
    {
      "text": "I hate this app so much. It repeatedly logs me out even though I’ve paid for a full year. Then makes it impossible to log back in. I follow the link to my account on the web, log in, see the acknowledgment that account has months left. Go back to the app and it just keeps demanding I subscribe. There is no way to log out and in in the app. Just a huge waste of time.",
      "title": "So frustrating",
      "date": "2025-07-08T22:11:37-07:00",
      "user": "This nickname is taken 98765",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Hate the app.  Always have so many login problems",
      "title": "Love the magazine",
      "date": "2025-07-08T01:35:44-07:00",
      "user": "MadBatterEvans",
      "version": "10.7.1",
      "rating": 3
    },
    {
      "text": "Audio took forever to load and would not play on older articles.",
      "title": "Audio does not work on older articles",
      "date": "2025-07-05T14:37:54-07:00",
      "user": "xxuan17",
      "version": "10.7.1",
      "rating": 3
    },
    {
      "text": "It refuses to keep me logged in and has been unable to link my Apple-purchased subscription. I can’t believe this is possible in 2025!",
      "title": "Impossible app",
      "date": "2025-07-04T22:33:58-07:00",
      "user": "TZAQTUY",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "After downloading issues to my phone, the app can’t access them offline. Tried their workarounds to no avail. Purchased subscription for something to read while traveling (without internet), and now I have nothing to read.",
      "title": "Dysfunctional",
      "date": "2025-07-04T09:17:08-07:00",
      "user": "Joemogo",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "I like to listen to articles while I do chores, but it stops playing when the screen shuts off.",
      "title": "Audio glitch",
      "date": "2025-07-04T08:15:28-07:00",
      "user": "Rgf418",
      "version": "10.7.1",
      "rating": 2
    },
    {
      "text": "This app has suddenly decided not to let me in. It says I don’t have an active subscription at this email address. I click the link to check my subscription online. Online, on a web browser, I see that I have an active subscription. But there’s no way to get the website to tell the app that. So this app is suddenly useless.",
      "title": "Doesn’t recognize subscription",
      "date": "2025-07-03T13:06:33-07:00",
      "user": "LaffitteFL",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "You have to be kidding me with this. Force an update but log you out, and then make sure the UI doesn’t allow for you to log back in. This keeps up and my subscription moves to NYmag.",
      "title": "Going so downhill",
      "date": "2025-07-01T08:23:23-07:00",
      "user": "gore",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Beautiful app that somehow does not allow me to search by author to find stories by my favorite staff writers…..please make the author page pop up first when I search their name in the app nor random daily coverage summaries. Or better yet make the staff writer pages easily accessible on home page or a tab.",
      "title": "UX",
      "date": "2025-06-30T20:56:39-07:00",
      "user": "Hmmmmeow!",
      "version": "10.7.1",
      "rating": 3
    },
    {
      "text": "I love my New Yorker!  But the app is constantly having issues and a pain to navigate.",
      "title": "Great magazine, terrible app",
      "date": "2025-06-30T07:12:11-07:00",
      "user": "mkemom66",
      "version": "10.7.1",
      "rating": 2
    },
    {
      "text": "I can’t access anything now with the recent updates.   Bummer - I have been a loyal subscriber for 15 years and switched to digital only during Covid.  Loved reading it on my iPad.  I haven’t been able to access anything after the last two updates.",
      "title": "iPad app is horrible the last few weeks",
      "date": "2025-06-29T11:31:45-07:00",
      "user": "Loyal digital subscriber",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Why oh why does the search function kids stink?",
      "title": "Love it AND…",
      "date": "2025-06-28T13:21:16-07:00",
      "user": "tteedgj",
      "version": "10.7.1",
      "rating": 5
    },
    {
      "text": "The app signs me out frequently, so that when I go to use it on a plane I am logged out and have to wait until I’m back on the ground to log back in",
      "title": "Unreliable",
      "date": "2025-06-27T08:10:40-07:00",
      "user": "12:;)&!:25",
      "version": "10.7.1",
      "rating": 3
    },
    {
      "text": "I have read the New Yorker and loved it since the birth of time. When this app started years ago I was immediately astonished that it didn’t just have a PDF option.  I want to read the magazine the way it was written. I switched over to reading it on ZINIO, which provides the right format. But…the magazine won’t accept using ZINIO as being a true subscriber. And thus it will not allow readers to see all the daily content from their email. I have now tried again, and this app is as bad or worse than ever. I will cancel my subscription immediately and go back to ZINIO. This format is PATHETIC.",
      "title": "Unbearably bad app",
      "date": "2025-06-26T21:16:31-07:00",
      "user": "negative progress",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "The app works. It’s had glitches: Long load times, “History” of articles I’ve read is randomly cleared out, get signed out of my account. The web browser is easier to use.",
      "title": "Glitchy but works",
      "date": "2025-06-26T06:20:43-07:00",
      "user": "Justmayhah",
      "version": "10.7.1",
      "rating": 3
    },
    {
      "text": "I was using the app for audio content but don’t anymore. The human readers are great. The AI voices are god awful, and I’d rather support work by human beings. Without an option to filter out the automated voices except by hitting play on each individual article, the app is useless.",
      "title": "AI voices make the app unusable",
      "date": "2025-06-24T09:40:21-07:00",
      "user": "RStevensStanwick",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "The app worked for a hot second but now all it does is stall as it tries to load. Without ever loading. So in essence, it’s useless.",
      "title": "App won’t load",
      "date": "2025-06-22T23:24:12-07:00",
      "user": "NELAReader",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "You can’t open the app and be right in the story you were in the middle of reading anymore - or even in the issue you were reading. You have to go through multiple steps to get back into the issue and then the story. The cartoon captions in the section with all cartoons in the issue are way too small to read.",
      "title": "So much worse than it used to be",
      "date": "2025-06-22T18:34:31-07:00",
      "user": "purpleechium",
      "version": "10.7.1",
      "rating": 3
    },
    {
      "text": "Top stories and audio not loading at all.  Just the spinning wheel spinning",
      "title": "New app is bad",
      "date": "2025-06-22T14:07:38-07:00",
      "user": "Christofish",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "As the title says - the app just doesn’t load articles or any of the content. The only time it sometimes works is if I follow a link from the newsletter in the email. I’m a new subscriber so find this to be a very frustrating thing, that I can’t use the app to read what I’m paying for but instead have to read it in Safari. \nI’m still waiting for my first print issue to arrive so not enjoying having to read on the internet rather than the app.",
      "title": "App doesn’t work",
      "date": "2025-06-22T10:19:34-07:00",
      "user": "BostonMan2725",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Stories and issues don’t load, even after multiple tries. Force-quitting and restarting the app doesn’t help either. Seems like Advance took a good app and made it practically unusable.",
      "title": "Breathtakingly buggy",
      "date": "2025-06-21T15:22:10-07:00",
      "user": "slandau6",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Originally, the app was just to read the print edition of the New Yorker. It worked well. Fast, reliable, and a joy. Now the app is unstable, crashes frequently, loads content I have zero interest in immediately upon opening instead of allow allowing me to access what I want to access immediately. Does not work with multiple VPNs, and each update tries to hide the magazine itself. I just want to read the print edition of the magazine on my tablet.\n\nEach update makes this app more difficult to use.",
      "title": "App seems to exist to frustrate.",
      "date": "2025-06-21T12:02:00-07:00",
      "user": "ShoutandEcho",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "I wrote a review a couple of days ago and it hasn’t posted. Probably because they don’t want to show another negative review. The app doesn’t work. Doesn’t load top stories. Doesn’t load Listening. Usually can get to the magazine but not always. Contacted support, which is their only response, and was told to use the web. What’s the purpose of an app, expensive at that, only to be told not to use it. Please, please fix it or I’ll just need to cancel the subscription.",
      "title": "Terrible",
      "date": "2025-06-21T09:12:01-07:00",
      "user": "Daa524",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "6/2025: Please note actual changes, fixes, or enhancements in each update note.  And please give us the option to disable auto play videos!  I despise them.  \n\n1/21/2021:  First, there is no question that the New Yorker’s content is excellent.  My issues are technical ones with the app.  \n\nSpecifically, I wish there was a option to disable auto play of videos.  Second, when I minimize the app and then go back in, the story I’m reading refreshes itself and takes about 10 seconds to return me back to my place on the page, which is annoying.",
      "title": "This review is updated regularly to improve your experience",
      "date": "2025-06-21T04:58:41-07:00",
      "user": "Regular Guy 95",
      "version": "10.7.1",
      "rating": 4
    },
    {
      "text": "Trying to download some stories and digital magazine copies before an international flight tomorrow. App doesn’t contain any of my bookmarked stories or magazine issues. What a perfect time to have such a bug!",
      "title": "No content",
      "date": "2025-06-20T20:56:20-07:00",
      "user": "zorbadgreek",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Broken. Spinning wheel. No content despite multiple reinstallations. Please fix your app.",
      "title": "Does not work",
      "date": "2025-06-20T20:54:30-07:00",
      "user": "Iga99",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Freezes, quits, unstable.  Most troublesome app on my iPad.",
      "title": "Terrible app",
      "date": "2025-06-20T16:16:45-07:00",
      "user": "Bwb41",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Basically no longer works.  Signing out and signing back in gets me the magazine.  But the latest stories don’t seem to update at first the screen is blank, then, if I remove the app from memory and go back in I’ll see stories from almost a month ago.  Used to be such a good app, but not right now.",
      "title": "Super glitchy",
      "date": "2025-06-20T14:24:07-07:00",
      "user": "lucenvoyage",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "It’s almost impossible to cancel my subscription and I still haven’t found a way yet.",
      "title": "Get Me Out Of Here",
      "date": "2025-06-20T13:37:14-07:00",
      "user": "Brad4221",
      "version": "10.7.1",
      "rating": 5
    },
    {
      "text": "First, it threw me off the app, because it was unable to find my subscription. Then it was unable to link the app to my subscription. Once I fixed that and it allowed me back into the app, it now fails to update the articles. It has been on Monday for a week.\n\nIn response to this review, the “developer” responded that the problem is my fault. Techno-arrogance wears thin.",
      "title": "Useless App",
      "date": "2025-06-20T13:18:46-07:00",
      "user": "rmurchl",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "I love the New Yorker but this app has become garbage. It will take 10 minutes to update and sometimes will not update at all. Opening an article in the app via weblink can also take forever or fail entirely. This is happening across all devices, and has been going on for a few weeks.",
      "title": "App functionality",
      "date": "2025-06-20T11:52:36-07:00",
      "user": "LBCBear02",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "Since the last update the app, which was never fast or user friendly, is even worse. Crosswords don’t populate, content doesn’t appear. Does anyone test this before it’s inflicted on paying customers?",
      "title": "Doesn’t load content",
      "date": "2025-06-20T11:22:53-07:00",
      "user": "jamesathon123",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "A fine app, but in this new release I’m having trouble accessing recent back issues. I’m always a few weeks behind, of course, but trying to get to the next issue in sequence is throwing up errors. It’s also annoying that when I leave the app and come back later, it always throws me back to the home page instead of leaving me in whatever article I was partway through.",
      "title": "Issues with issues",
      "date": "2025-06-19T21:04:38-07:00",
      "user": "ZeroDank20",
      "version": "10.7.1",
      "rating": 3
    },
    {
      "text": "App is slow and sometimes non-responsive. Top stories don’t load and while I can covers of issues they also don’t load.",
      "title": "Great mag, can’t get to stories",
      "date": "2025-06-19T13:33:44-07:00",
      "user": "000004444678",
      "version": "10.7.1",
      "rating": 1
    },
    {
      "text": "I was able to complete the update and now the app opens on my iPad. Finally I can get back to reading.",
      "title": "Update helped",
      "date": "2025-06-19T08:02:27-07:00",
      "user": "Tangerine244",
      "version": "10.7.1",
      "rating": 4
    },
    {
      "text": "Bad before, somehow worse now. Considerable connectivity and power management problems.",
      "title": "How have they managed to make it even worse?",
      "date": "2025-06-18T20:11:24-07:00",
      "user": "Bclem2003",
      "version": "10.7.0",
      "rating": 3
    },
    {
      "text": "I love the New Yorker but since the update in late June 2025 the app on iPad has been very glitchy with trying to read the full magazine. The only thing that works properly is the games. I called and they opened a ticket. I hope it gets fixed soon. I can’t be the only experiencing these issues with the latest update?!?",
      "title": "App Glitchy",
      "date": "2025-06-18T19:48:53-07:00",
      "user": "CarlWarsaw",
      "version": "10.7.0",
      "rating": 2
    },
    {
      "text": "The app was constantly bringing up a pop-up asking me to update. When I finally updated it, it just stopped working – it simply crashes every time I try to open it. This despite the fact that it says the app should be compatible with my version of iOS.",
      "title": "stopped working after an update",
      "date": "2025-06-18T15:05:10-07:00",
      "user": "Reader from Chicago",
      "version": "10.7.0",
      "rating": 1
    },
    {
      "text": "Randomly says I'm not subscribed. Sometimes loads. Sometimes doesn't. Has been going on for years.",
      "title": "Such poor functionality",
      "date": "2025-06-17T21:41:49-07:00",
      "user": "Loulew22",
      "version": "10.7.0",
      "rating": 2
    },
    {
      "text": "iPad app version works bad. It doesn’t update as supposed to. I have five days old articles no matter what I do.",
      "title": "iPad app is bad",
      "date": "2025-06-17T17:56:41-07:00",
      "user": "Mr. Zagloba",
      "version": "10.7.0",
      "rating": 3
    },
    {
      "text": "Since last update (over a week ago) I can access my saved articles but nothing new. Multiple  attempts to uninstall and re-install have not helped.",
      "title": "Great content - horrendous app",
      "date": "2025-06-17T17:12:17-07:00",
      "user": "Krmoore7",
      "version": "10.7.0",
      "rating": 1
    },
    {
      "text": "This app allows me to efficiently navigate the rich magazine. I especially enjoy being able to save articles I’ve read, access the crossword and audio features easily, and access the archive. \n\nThe one critique I have is that the new update does not launch and brings me back to the AppStore when I’ve already updated the app.",
      "title": "Solid app",
      "date": "2025-06-16T11:02:20-07:00",
      "user": "syedahira88",
      "version": "10.7.0",
      "rating": 4
    },
    {
      "text": "Crashes upon opening",
      "title": "Will not stay open!",
      "date": "2025-06-15T09:25:09-07:00",
      "user": "Spetkus27",
      "version": "10.7.0",
      "rating": 1
    },
    {
      "text": "The New Yorker app does not launch since the update a few days ago. The opening screen appears briefly, then the app closes. This is on my iPhone 8, iOS 16.7. My husband has the same phone and the same problem.",
      "title": "Recent update fails to launch",
      "date": "2025-06-14T06:02:13-07:00",
      "user": "Arfubola",
      "version": "10.7.0",
      "rating": 1
    },
    {
      "text": "After being a subscriber for nearly two years and reaching out to customer service several times, I never received a tote bag as advertised. Despite enjoying the magazine, I eventually unsubscribed due to the frustration over repeated broken promises for something I was really looking forward to.",
      "title": "No tote bag",
      "date": "2025-06-13T06:00:34-07:00",
      "user": "OnePantSock",
      "version": "10.7.0",
      "rating": 2
    },
    {
      "text": "It used to, but now it just closes and won’t run",
      "title": "Does not run on iPad Air 2 running iOS 15.8.4",
      "date": "2025-06-12T09:53:28-07:00",
      "user": "Gusfactor",
      "version": "10.7.0",
      "rating": 1
    },
    {
      "text": "Auto cuts my audio on other apps when opening app. Super glitchy offline / in airplane mode",
      "title": "Terrible app design",
      "date": "2025-06-05T05:34:16-07:00",
      "user": "mloverrr",
      "version": "10.6.16",
      "rating": 1
    },
    {
      "text": "Won’t load after update",
      "title": "Won’t load on iPad mini after latest update",
      "date": "2025-06-02T07:52:37-07:00",
      "user": "k11s11",
      "version": "10.6.16",
      "rating": 1
    },
    {
      "text": "Every update of this app has made it worse for users. I still remember the version from a few years ago where you could close the app and it would reopen in the same place in an article where you left off. Then they updated it so that you lose your place in an article when reopening the app. This most recent update goes even further. Even if you don’t quit the app it will always reopen to the home page after you close it and make you navigate back to your magazine issue/article. Can we please just have an app that lets us read our digital magazine like we had 10+ years ago???",
      "title": "Worse with every update",
      "date": "2025-05-30T15:50:14-07:00",
      "user": "Marc Dumerdier",
      "version": "10.6.15",
      "rating": 1
    },
    {
      "text": "The absolute BEST news & culture magazine app. It's so easy and clear. And the content is magnificant!",
      "title": "100 years old and still the BEST!",
      "date": "2025-05-25T17:59:39-07:00",
      "user": "jimcraig1959",
      "version": "10.6.14",
      "rating": 5
    },
    {
      "text": "The New Yorker magazine is perhaps the greatest magazine ever. This app does it proud.",
      "title": "Excellent App",
      "date": "2025-05-25T09:43:05-07:00",
      "user": "Happy Customer 42",
      "version": "10.6.14",
      "rating": 5
    },
    {
      "text": "All my life, I have seen multiple copies of The New Yorker lying around.   Some open to a page, some missing a cover, and varying in ages.  My grandparents shared theirs with my parents. My first entire piece was about corn.  I let it go once during a particular short-lived editorship and a person called to ask why.  It’s a calming, provocative presence without whom I would be a lesser person.  When clarity of purpose, voice, and integrity coincide, it must be maintained now as ever.",
      "title": "All My Life",
      "date": "2025-05-24T09:26:30-07:00",
      "user": "Itsybitsyvoice",
      "version": "10.6.14",
      "rating": 5
    },
    {
      "text": "For such a popular magazine I am amazed at the nonfunctional state of the site. Slow and buggy and half the links for support/FAQs take you to dead ends.",
      "title": "Website and app need to be updated",
      "date": "2025-05-23T18:40:07-07:00",
      "user": "Ian1810",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "I’m dumbstruck that one of the best magazines in the country/world still hasn’t put enough resources making a half decent app. It’s buggy, logs me out constantly, won’t download magazines to read offline. It’s about time Condé Nast gets its act together",
      "title": "For the love of god, fix this app",
      "date": "2025-05-23T18:35:26-07:00",
      "user": "Arrozero9",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "I don’t think that this a great app. If I leave in the middle of reading an article, when I come back to the app it automatically takes me to the home screen, meaning I usually will have to make several clicks, trying to remember in which print issue the article is, etc. Also, I’m often getting signed out, meaning I need to sign in again, and then it says that that I don’t have a valid subscription or something like that…. Also, for my taste, there’s much too much politics and current events in the New Yorker. I prefer more cultural offerings. I’m sick of politics and get enough of it everywhere else – in the Times, in podcasts, on late-night…. The New Yorker’s writers and editors can make any subject interesting, but now there are so many articles which I don’t read due to lack of inherent interest on my part. The New Yorker should be better than that.    Oh – the app isn’t good in landscape, the text is too wide. I don’t enjoy portrait orientation and changing the orientation of my iPad.",
      "title": "Could be better",
      "date": "2025-05-23T12:45:58-07:00",
      "user": "Threeekings",
      "version": "10.6.14",
      "rating": 3
    },
    {
      "text": "But too much. How do they do it???",
      "title": "The best",
      "date": "2025-05-21T23:14:39-07:00",
      "user": "jon.e.h",
      "version": "10.6.14",
      "rating": 5
    },
    {
      "text": "The garbage app won’t download new issues and claims I have no subscription. If I have no subscription then why do you keep taking money from me??",
      "title": "Paid for subscription, can’t read new issues",
      "date": "2025-05-20T11:36:00-07:00",
      "user": "NLM87",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "Being able to access The New Yorker on my phone is brilliant. The search and archiving functions are superb. And most importantly, if I get about a paragraph into any New Yorker article, there’s no going back. The articles are written so superbly across the board, reading them in part is almost as impossible as eating only one potato chip. These people know what they’re doing haha. Style and information and integrity IN SPADES!",
      "title": "Addictive reading",
      "date": "2025-05-19T08:27:27-07:00",
      "user": "23984792hef",
      "version": "10.6.14",
      "rating": 5
    },
    {
      "text": "So I’ve been trying to look at the materials provided but it has a message, “Subscription not found” but I do have an email welcoming me and paid receipts.  How long does it take for this all to be caught up!!!!!",
      "title": "I paid for the reduced 1 year subscription…Where is it?",
      "date": "2025-05-18T09:43:06-07:00",
      "user": "ArtsMaven",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "The buggiest magazine app I use. Really just terrible. Pages don’t refresh. Why pay for if it isn’t going to work. Time to cancel.",
      "title": "Just a bad app",
      "date": "2025-05-15T15:18:13-07:00",
      "user": "BNWINSF",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "I just want to read the weekly magazine that I download, but every time I leave the app (not even close it) and return, I’m back at the app’s top stories instead of the article I was reading. I then need to go back to the issue, find the article, and scroll to find the place I left off. Not to mention trying to do it offline when I’m traveling! Stop forcing me to read your site and just let me read the weekly magazine!",
      "title": "Terrible magazine to site sync",
      "date": "2025-05-14T18:34:59-07:00",
      "user": "john.wall",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "Almost never works with cell data",
      "title": "Rarely works",
      "date": "2025-05-13T17:17:16-07:00",
      "user": "gobchavez",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "I tried deleting and reinstalling the app, but nothing worked. I cannot read anything and downloads keep failing. What should I do?",
      "title": "None of the issues could be downloaded.",
      "date": "2025-05-13T16:31:48-07:00",
      "user": "katkatyy",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "I pay a lot for full print and online subscription and am unable to see ANY content on app on my iPhone.",
      "title": "Terrible app",
      "date": "2025-05-13T13:12:30-07:00",
      "user": "pcfmiami",
      "version": "10.6.14",
      "rating": 1
    },
    {
      "text": "I would love to be able to adjust text size and have a night mode. It says go to Settings to adjust text size but it’s not there either. Everything else is great.",
      "title": "Content good. Functionality needs improvement.",
      "date": "2025-05-12T23:25:28-07:00",
      "user": "Suz555",
      "version": "10.6.14",
      "rating": 3
    },
    {
      "text": "The search function on this app is practically useless. Not even quotation marks help. I have to search on google and then open the link in the app. It’s also a pain that you can’t navigate by section.",
      "title": "Search Issues",
      "date": "2025-05-09T16:33:07-07:00",
      "user": "kinaleigh",
      "version": "10.6.14",
      "rating": 3
    },
    {
      "text": "The print app going away, this is supposed to be the new way to access issues. Downloading am entire issue is hit or miss. Reading cartoon captions on an iphone mini is close to impossible because the font size is less than 5. Not thought fully through yet. Convoluted tab system mixing articles and issues. Finally, this app blocks any ongoing streaming sound from other apps even if it does not thankfully automatically play audio.",
      "title": "Buggy, unreadable",
      "date": "2025-05-07T01:57:56-07:00",
      "user": "SG NY",
      "version": "10.6.14",
      "rating": 2
    },
    {
      "text": "The app recently has started stalling playback in the Apple Music app on my iPhone. It didn’t used to do this. Please remedy. Thanks.",
      "title": "Conflict with music app",
      "date": "2025-05-06T04:47:28-07:00",
      "user": "G. Ben",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "Customer service is even worse! The app repeatedly over the course of months tells me that I don’t have a subscription. I dutifully sign back in. Why is it that the New Yorker is the only publication that does this? Please do not suggest that I delete and reinstall the app.  I have. Many times. It does not help.  Good magazine.  Your app is the worst.",
      "title": "Worst magazine app ever",
      "date": "2025-05-05T20:21:54-07:00",
      "user": "David N Derbyshire",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "Also has no search function",
      "title": "Slow, laggy, useless",
      "date": "2025-05-05T13:18:09-07:00",
      "user": "a hs hshdhehhebe",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "I was promised a bag with The New Yorker on it. No response to emails, calls, letters. Also finding it difficult to cancel subscription. Otherwise it's a great magazine but I can't overlook the lack of response.",
      "title": "No bag, Hard to cancel",
      "date": "2025-05-05T05:11:04-07:00",
      "user": "Dodie7-11",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "It’s hard to believe this app doesn’t support dark mode for print disabled readers. It also relies on system settings for increased text size, but the choice of larger text in the OS doesn’t seem to be implemented in the app itself. Disappointing.",
      "title": "Quality Content; Poor Accessibility",
      "date": "2025-05-04T11:12:11-07:00",
      "user": "Abinalex",
      "version": "10.6.13",
      "rating": 3
    },
    {
      "text": "Why can’t it remember what I was reading. Not interested in its choice of daily updates. \nAlso login issues between web and app. \nWould def go back to paper magazine if they wouldn’t pile so.",
      "title": "It’s okay",
      "date": "2025-05-01T18:38:17-07:00",
      "user": "Madhusathi",
      "version": "10.6.13",
      "rating": 3
    },
    {
      "text": "Rarely updates without hanging. Feels like they don’t want customers to actually access content.  Never again.",
      "title": "Extremely slow",
      "date": "2025-04-23T15:54:37-07:00",
      "user": "xolotado",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "I love the magazine and the content, but it unfathomable why the developer can not enable dark mode reading (white text, black background) like the NYT, the Atlantic, and other publications. Disappointed and angry!!!",
      "title": "Why no dark mode?!?!?",
      "date": "2025-04-22T16:54:07-07:00",
      "user": "Loyal Reader",
      "version": "10.6.13",
      "rating": 2
    },
    {
      "text": "This is da bomb! Totally. Humor, criticism, commentary, fiction, poetry, great writing and games! You can’t beat it.",
      "title": "Love it",
      "date": "2025-04-22T12:38:37-07:00",
      "user": "PJ-B",
      "version": "10.6.13",
      "rating": 5
    },
    {
      "text": "I really detest this app, which has a number of infuriating characteristics. First, the app defaults to the Top Stories tab even if it’s been only about an hour since you’ve been in the middle of a story in the Magazine tab. Second, while it will keep your place in a story, it will not keep you place in your downloaded magazines. That is, after its default to Top Stories, you need to locate both the issue you were reading and navigate to the article, where it will have more-or-less kept your place. Ideally, when it opens it should default to where you were, not to Top Stories, but if it does, it should immediately go to the issue, article and place in the article you were in the process of reading when you click on the Magazine tab. And then, there is an real design problem: when you are not connected to the internet (example: on the subway between stations), when you click on the Magazine tab to access your downloaded magazines, there is a very substantial delay in opening the that tab. This should be immediate in the absence of internet connectivity. The New Yorker, which is itself indispensable, could do much better by its users.",
      "title": "Great content, infuriating app",
      "date": "2025-04-22T09:58:00-07:00",
      "user": "Random Man, the other one",
      "version": "10.6.13",
      "rating": 3
    },
    {
      "text": "Why New Yorker!!! I have written, I have begged and pleaded, yet I am still blinded by the WHITE page of the night!! For Pete’s sake, can we please one day get night mode?",
      "title": "WHY!!!!",
      "date": "2025-04-21T21:24:13-07:00",
      "user": "nothankyouwastaken",
      "version": "10.6.13",
      "rating": 5
    },
    {
      "text": "The New Yorker is one of the places I go for excellent journalism that is fact based and humane in perspective. Supporting this magazine is crucial in these dark days.",
      "title": "M. Gessen and other brilliant journalists.",
      "date": "2025-04-19T21:04:41-07:00",
      "user": "Jake2PDX",
      "version": "10.6.13",
      "rating": 5
    },
    {
      "text": "This literary magazine is so beautifully written and edited, it is a treat to receive each week, for 65 years!!",
      "title": "Wonderful magazine",
      "date": "2025-04-17T20:56:08-07:00",
      "user": "jo ridet",
      "version": "10.6.13",
      "rating": 5
    },
    {
      "text": "Impossible to use. Junk Ads everywhere. Too small print to read. May cancel subscription. Can’t read print.\n\n  . .",
      "title": "New New Yorker terr",
      "date": "2025-04-16T01:38:48-07:00",
      "user": "borcad$@64",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "How does this app still not support dark mode. It is for reading. Why do I have to sign in every time I want to read something.",
      "title": "Dark mode & stop signing me out",
      "date": "2025-04-15T17:42:47-07:00",
      "user": "bubjafrig",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "Horrible app. Horrible magazine. Even worse customer service - stay far away from The New Yorker.",
      "title": "Horrible",
      "date": "2025-04-15T09:36:13-07:00",
      "user": "Discogs booooo",
      "version": "10.6.13",
      "rating": 1
    },
    {
      "text": "Will the new yorker ever figure out subscription services?",
      "title": "Lousy subscription service",
      "date": "2025-04-14T20:19:46-07:00",
      "user": "Johnfalky",
      "version": "10.6.12",
      "rating": 1
    },
    {
      "text": "Was having a problem with the app and the developer solved it based on my review. That’s pretty top notch I’d say. As far as the app itself, it’s nice to have a selection of audio to choose from.",
      "title": "Updated review",
      "date": "2025-04-12T13:26:24-07:00",
      "user": "Idontwantanickname11111",
      "version": "10.6.11",
      "rating": 4
    },
    {
      "text": "Been reading the NYer for a long time from print through various app iterations.  The apps continue their downward trend.   The prior app (magazine only) would lose my place in long articles if I accidentally jumped to the next or previous article.  The cartoon contest required a jump to the website for the current contest rather than the one for the issue you are reading. \nThe current app is worse.  It refuses to save my place in the magazine article I am reading.  When returning to the app it defaults to the “Top Stories” and I must navigate back to the magazine, the issue I was reading, the article, and the line.   There is no way to place a bookmark to hold my place.  This is basic stuff. Why lose your place in a long article. Why no bookmarks? Why push the reader to “Top Stories”?  \nI just want to read the magazine issue by issue, article by article.   Why push the reader around?",
      "title": "Worser and worser",
      "date": "2025-04-08T07:31:15-07:00",
      "user": "MLJ__",
      "version": "10.6.11",
      "rating": 1
    },
    {
      "text": "Edit: The issue that was preventing me from signing in seems to have been resolved, so I’m updating my rating accordingly. \n\nThank you to those who resolved the issue!\n\n— \n\nI just signed up for a digital subscription, and have already been invoiced, but am unable to access the app.\n\nWhen I try to sign in on the app, it takes me to Condé Nast sign in page (id.condenast.com). \n\nIt says I'm already signed in to The New Yorker (from the web page), and has a button “Continue with same account”. \n\nWhen I click that, it gives an error message that reads “Error: Auth token verification failed due to : invalid signature”.\n\nIf I go back and click the other option “Sign in another way”, it again gives the email option, along with options for Google, Facebook, and Apple. \n\nI don’t want to use those other options, so I again try to  sign in with my email, and get the same error message again.\n\nIt also gives the option “Link to your print subscription”. I tried that too, even though I'm a digital subscriber. It then says “Choose a linking option”, with options for “By account number”, which I don’t know, and “By name and address”. \n\nI enter my address, and it says “Subscription not found”, along with my email address, and then says “This account doesn’t have an active subscription. Please subscribe to use this app.”\n\nIt says this even though I do have an active subsciption. \n\nI then sign in to the web version, which seems to work fine, go to “Manage account”, where it says I’m signed in, then click “Manage Subscription”, where it takes me to a Condé Nast affiliated website (condenast.chargebee.com), where it says NEWYORKER - Digital Subscription, and the amount I was billed, but there’s no Account Number listed. \n\nThere is an option “Account Information”, but when I click that it only has my name and “Locale: English”, but again, no Account Number. \n\nOn the invoice, it has an alphanumeric Customer ID and Subscription ID, but no numeric Account Number.\n\nThe linking option only accepts a numeric Account Number.\n\nI tried clearing the cache, offloading the app and reinstalling it, and deleting the app and reinstalling it, but each time I receive the same error message.\n\nI also tried signing into the app with my iPad, but I received the same error message “Error: Auth token verification failed due to : invalid signature”.\n\nThis is very frustrating.",
      "title": "Digital Subscriber, but can't sign in",
      "date": "2025-04-07T23:10:30-07:00",
      "user": "zenfox",
      "version": "10.6.11",
      "rating": 4
    },
    {
      "text": "I’m tired of companies cutting corners with AI. What’s worse is that some think it’s better—but it’s not. I’m docking stars because someone approved using robotic, tone-deaf story narration. It’s harder to follow because it’s too perfectly dictated and lacks the natural flow of human speech.",
      "title": "I come here for quality content, muddied by AI.",
      "date": "2025-04-06T13:35:44-07:00",
      "user": "iNealio",
      "version": "10.6.11",
      "rating": 3
    },
    {
      "text": "Once the app acknowledges that I have a print subscription, it works fine, but I have to re-link to it every time I open the app on my iPad. Why???  It’s so frustrating.",
      "title": "Frustrating",
      "date": "2025-04-06T12:59:56-07:00",
      "user": "Kathy Z.",
      "version": "10.6.11",
      "rating": 1
    },
    {
      "text": "does not give access to print edition.  now says I don’t have an acct although my subscription runs for another 8 months.",
      "title": "lousy app",
      "date": "2025-04-06T07:19:55-07:00",
      "user": "EV1851",
      "version": "10.6.11",
      "rating": 1
    },
    {
      "text": "No customer support.  The phone number given does not work, \nTells me there is a token error.  \nI have uninstalled the app. \n\nI have supported this magazine for years: honestly you guys have zero support.  \n\nShame on you.",
      "title": "I have a subscription that I cannot access",
      "date": "2025-04-06T06:49:56-07:00",
      "user": "Spaceapostle",
      "version": "10.6.11",
      "rating": 1
    },
    {
      "text": "Cannot access content because the app can’t find my subscription. I reached out to support and reset my password as advised. I deleted and reinstalled the app. Nothing has worked. It’s useless.",
      "title": "Cannot link subscription",
      "date": "2025-04-05T08:19:43-07:00",
      "user": "pksf",
      "version": "10.6.11",
      "rating": 1
    },
    {
      "text": "It seems like every time this app is updated, I have a hard time logging in, it says I don’t have an active subscription, etc. This latest update has totally broken login and I’m getting some kind of token error. I can’t recall the last time I regretted subscribing to a publication as much as this. And I subscribed because I believe in the New Yorker and the quality of the publication, but boy do they change some of the people on their app development team",
      "title": "Trash app, great content",
      "date": "2025-04-05T07:44:12-07:00",
      "user": "Bzzzzzzz",
      "version": "10.6.11",
      "rating": 1
    },
    {
      "text": "It still won’t let me see every article by an author and now it’s broken and won’t let me read anything.",
      "title": "Deeply frustrating",
      "date": "2025-04-04T21:00:23-07:00",
      "user": "SKNEIL",
      "version": "10.6.11",
      "rating": 1
    },
    {
      "text": "The New Yorker is the best magazine in the world. The online magazine is good. But the app signs me out all the time. No other publication I subscribe to has that problem.   Why can’t the most enlightened publication in the world solve that simple \nproblem?",
      "title": "Get a new app developer",
      "date": "2025-04-04T12:45:35-07:00",
      "user": "RJAP",
      "version": "10.6.11",
      "rating": 2
    },
    {
      "text": "This app is simple terrible.  I cannot open the magazine, although I pay monthly through ‘Apple, except on my tiny iPhone #12.  It keeps indicating that I am not the person who has subscribed.  My mail is not answered.  I am amazed at the negligence and neglect of the New Yorker.",
      "title": "New Yorker Review",
      "date": "2025-03-30T21:04:15-07:00",
      "user": "RuthSchepper",
      "version": "10.6.10",
      "rating": 1
    },
    {
      "text": "Can we add a dark feature? I read at night and the bright white is blinding. Also I might be stupid and can’t find it, if that’s not the case can we make it obviously placed.",
      "title": "Dark feature",
      "date": "2025-03-28T22:47:50-07:00",
      "user": "Liam x kelly",
      "version": "10.6.10",
      "rating": 5
    },
    {
      "text": "Everytime I attempt to see my content I get caught up in a circular sign in process with Condenast, it never acknowledges me as a subscriber. Sometimes by tapping the X in the upper right-hand corner and get to the article I wish to read but that is not always the case. My other digital content like the Atlantic on tap and I am recognized as a subscriber.",
      "title": "Repeated issue in getting to the content I paid for.",
      "date": "2025-03-28T19:26:56-07:00",
      "user": "Plinkrr",
      "version": "10.6.10",
      "rating": 1
    },
    {
      "text": "Still no dark mode.\nConstantly logs me out; this is insane because it makes it impossible to read offline when I don’t have service.",
      "title": "Love the magazine, app is mediocre",
      "date": "2025-03-25T16:04:04-07:00",
      "user": "M-A-X-X-X",
      "version": "10.6.9",
      "rating": 1
    },
    {
      "text": "Now I can listen to Sedaris in battery-saving screen lock mode! \n\nBefore the recent app update, the only way to keep Sedaris narrating was to set Lock Screen to “Never”,  thus heating my iPhone to toasty.",
      "title": "Hearting Dev for fixing the audio player!",
      "date": "2025-03-25T09:47:50-07:00",
      "user": "JZJK",
      "version": "10.6.9",
      "rating": 4
    },
    {
      "text": "I love the writing in the New Yorker. I stopped using the app when they moved to AI-generated story narration.\n\nWhen this app auto-renewed, I was unable to cancel via their email service, and was asked to call a number. I was transferred to the same two offices back and forth six times with no resolution and spent nearly an hour on the phone. Gross!",
      "title": "Great writing, degraded experience, kafkaesque customer support",
      "date": "2025-03-24T14:21:30-07:00",
      "user": "broguinn",
      "version": "10.6.9",
      "rating": 1
    },
    {
      "text": "Mostly good app, no real improvement over the prior app. Big failure in cartoons feature. The tiny italic type face, white on black, is difficult to read on 11” iPad screen. Very fatiguing for me is putting it mildly. My subscription is up in about 9 months. If it’s not fixed by then I’ll drop my subscription.",
      "title": "Cartoon captions unreadable",
      "date": "2025-03-24T09:34:36-07:00",
      "user": "SR310",
      "version": "10.6.9",
      "rating": 2
    },
    {
      "text": "I am constantly kicked out of the app and forced to log in again. Sometimes within a few hours.",
      "title": "Constant need to re-log in",
      "date": "2025-03-23T12:33:40-07:00",
      "user": "customer888888888",
      "version": "10.6.8",
      "rating": 2
    },
    {
      "text": "I do not know why it took me so long to subscribe; glad I did.",
      "title": "Necessary and fantastic topics which need to be read and discussed",
      "date": "2025-03-23T04:55:22-07:00",
      "user": "Tricoteurs",
      "version": "10.6.8",
      "rating": 5
    },
    {
      "text": "For those of us who love reading the New Yorker but experience light sensitivity that exacerbates migraine symptoms, the lack of a dark mode option for this app is an accessibility issue. Please offer dark mode!",
      "title": "Dark mode please!",
      "date": "2025-03-22T16:03:01-07:00",
      "user": "Me00012345",
      "version": "10.6.8",
      "rating": 4
    },
    {
      "text": "While this app has greatly improved, they desperately need to wake up and offer dark mode. No one likes reading white pages in bed. If there’s some misplaced fealty to the actual print magazine, it does no help to your readers. Folks should be able to choose, or just read the mag. It stops many of us from spending more time with the content. Pls go dark mode.",
      "title": "PLEASE GO DARK!!",
      "date": "2025-03-22T06:40:20-07:00",
      "user": "JonBlau",
      "version": "10.6.8",
      "rating": 3
    },
    {
      "text": "In the couple of months since I paid for a subscription here I have been excluded repeatedly and forced to sign in. Several times the app can’t verify the account or can’t find some sort of link with my Apple account. This appears to have something to do with the way Conde Nast handles the app and logging in. But I have no issue at all with other subscriptions, including the NTU and WSJ. If it continues I’ll simply cancel. Not worth the hassle.",
      "title": "Can’t log in",
      "date": "2025-03-21T23:06:24-07:00",
      "user": "Nickapprev",
      "version": "10.6.8",
      "rating": 1
    },
    {
      "text": "Very smooth and looks really nice. The auto reader voice is much more natural than NYT. Only problem is that it sometimes loses the “history” and forgets where I was at in an article.",
      "title": "Great app",
      "date": "2025-03-19T20:58:25-07:00",
      "user": "Pentaquine",
      "version": "10.6.8",
      "rating": 4
    },
    {
      "text": "One should be able to see all subscription information when signed in. This is a black box.",
      "title": "Quirky, unreliable app",
      "date": "2025-03-18T20:20:19-07:00",
      "user": "mochao2",
      "version": "10.6.8",
      "rating": 2
    },
    {
      "text": "I've recently gotten into the habit of reading new Yorker articles every night but the light mode hurts my eyes",
      "title": "Great app but sorely needs dark mode",
      "date": "2025-03-17T19:59:56-07:00",
      "user": "Sagar Srivastava",
      "version": "10.6.8",
      "rating": 4
    },
    {
      "text": "the new yorker seems to tinker with the app’s layout a lot. yet no dark mode. they must be the last news/literary app left not to offer dark mode. Even the new york times (“the grey lady”) has dark mode. dark mode makes sense - for power conservation, and for user experience (in bed, at night, not blasting your partner who’s trying to sleep). dark mode already!",
      "title": "No dark mode",
      "date": "2025-03-17T00:43:53-07:00",
      "user": "zapppers",
      "version": "10.6.8",
      "rating": 1
    },
    {
      "text": "The app itself works pretty well with one glaring exception: I have no way to update my email address. As I researched this, I also found that neither The New Yorker or Apple (or Condé Nast, for that matter) can help me make this change.  The New Yorker/ Conde Nast does not recognize me as a customer because it’s an ‘in-app purchase’ and Apple is clear that The New Yorker / Condé Nast should be able to help in updating the email address for my account.  I believe I’ll be forced to close out my current account and open a new one solely for the purpose of updating my email address.  This is frustrating as I will lose saved articles in the process.",
      "title": "Cannot Modify Account",
      "date": "2025-03-14T16:07:05-07:00",
      "user": "Annh89",
      "version": "10.6.8",
      "rating": 1
    },
    {
      "text": "Love the magazine. Hate the app. Too often the app says I don’t have a subscription but I do.",
      "title": "Does not recognize my subscription",
      "date": "2025-03-14T10:52:24-07:00",
      "user": "edavjen",
      "version": "10.6.8",
      "rating": 2
    },
    {
      "text": "Please improve the scrolling gestures, it feels slippery and buggy and at the moment.",
      "title": "Poor scrolling interaction",
      "date": "2025-03-13T06:38:18-07:00",
      "user": "ikealurker",
      "version": "10.6.8",
      "rating": 4
    },
    {
      "text": "They must be contracting with teenagers to write the software. I am  asked to link my print and online accounts all the time.\n\nI will cancel my expensive print subscription if it happens again.\n\nAnd, I cannot autofill my contact information to enter my name and address to link the accounts.\n\nA disaster.\n\nGary LeMasters",
      "title": "Amateurish",
      "date": "2025-03-11T05:02:05-07:00",
      "user": "Skeeles",
      "version": "10.6.8",
      "rating": 1
    },
    {
      "text": "I’ve been a subscriber for more than 25 years, first with the print magazine and the last 5 years digital. \n\nOver the years, accessing Monday’s digital issue had become increasingly frustrating: an inability to log in reliably, reliance on being on-line to read articles, (You can’t even look at the Cartoon captions off-line), and now a robot narrating. Excellent writing became overshadowed by a horrible UI. But now I have solved that problem. With no remorse I just cancelled my subscription.",
      "title": "Cannot access anymore",
      "date": "2025-03-10T02:53:08-07:00",
      "user": "Cackling Goose",
      "version": "10.6.8",
      "rating": 1
    },
    {
      "text": "The app constantly logs me out and says I don’t have a subscription, despite being up to date on a print subscription. Obnoxious and greedy.",
      "title": "Logs me out, says I don’t have a subscription",
      "date": "2025-03-09T19:37:12-07:00",
      "user": "ce_n'est_pas_un_nom",
      "version": "10.6.8",
      "rating": 1
    },
    {
      "text": "It’s great, but wish you had a shorter line width on iPad, as for example the Times has",
      "title": "Line width",
      "date": "2025-03-09T12:46:00-07:00",
      "user": "collage1",
      "version": "10.6.8",
      "rating": 5
    },
    {
      "text": "Every. Single. Time. Do better - your entire premise of having stuff downloaded ahead of time is useless if I get on the subway to find myself logged out",
      "title": "Stop logging me out",
      "date": "2025-03-05T20:07:01-07:00",
      "user": "TooManyFeelings",
      "version": "10.6.7",
      "rating": 3
    },
    {
      "text": "Even though I’ve paid for subscription, I am frequently to login. This has occurred at Wired and at the New Yorker.",
      "title": "Glitchy app",
      "date": "2025-03-05T19:24:55-07:00",
      "user": "River77forest",
      "version": "10.6.7",
      "rating": 1
    },
    {
      "text": "Add the caption for the cover!!!!!",
      "title": "Needs cover caption!!!",
      "date": "2025-03-04T19:45:04-07:00",
      "user": "gzerninplatz",
      "version": "10.6.7",
      "rating": 1
    },
    {
      "text": "Original by Jill Lepore",
      "title": "“In Every Dark Hour”",
      "date": "2025-03-04T13:00:40-07:00",
      "user": "Bert Seltzberg",
      "version": "10.6.7",
      "rating": 5
    },
    {
      "text": "I let my subscription lapse for five days after my free trial and I asked to cancel it and they refused despite my telling them the $186 subscription would be an economic hardship. It was a  really surprising and callous response and honestly pathetic that they’d rather grift than put out a product people actually want to pay for.",
      "title": "Watch out for auto renew",
      "date": "2025-03-03T23:03:37-07:00",
      "user": "Newyorkersucks2",
      "version": "10.6.7",
      "rating": 1
    },
    {
      "text": "Shame can’t out in dark mode to read at night. Deleting app and have canceled my subscription because of this. Honestly who wants to have their eyes blown out by more blue light?",
      "title": "No dark mode",
      "date": "2025-03-03T13:56:05-07:00",
      "user": "ohhohodoh",
      "version": "10.6.7",
      "rating": 1
    },
    {
      "text": "I love reading NY and find refreshing, entertaining, informative and some silly stuff .\nDavid  Remnick is superb and interviews are in-depth core to heart, most valuable for magazine \nBut support system is not up to par for this stylish magazine \nEvery year I prescribe and after few months, they lose my subscription, I have to send receipt but no luck",
      "title": "Support",
      "date": "2025-02-28T08:59:25-07:00",
      "user": "Khan 333",
      "version": "10.6.7",
      "rating": 5
    },
    {
      "text": "I've read the print version for decades and loved getting the audio version (through various sources, including audible). I used to listen to all available articles while commuting. One of the best features (besides the excellent writing) was high/quality narration. It could even draw me into to stories that I didn't think I'd be interested in. Recently more and more of the articles are rest by automated voices and I can't stand it. I keep trying, but inevitably switch it off 5 minutes in because the sound is so annoying. Please bring back human narrators!!",
      "title": "Love the magazine, used to love the audio version, but hate the transition to automated",
      "date": "2025-02-28T03:16:09-07:00",
      "user": "xasteria",
      "version": "10.6.7",
      "rating": 3
    },
    {
      "text": "This app, across multiple versions and phones, has never once returned to the page I was last reading when I open it after a long period of idleness. Moreover there is no way to bookmark or flag manually to try and get around this shortcoming.",
      "title": "Never remembers last page",
      "date": "2025-02-26T06:27:28-07:00",
      "user": "Dont want so many apps",
      "version": "10.6.6",
      "rating": 1
    },
    {
      "text": "Can’t find place to log on on App. Just subscribed last month & not being recognized",
      "title": "Login issues",
      "date": "2025-02-24T15:48:14-07:00",
      "user": "Kbgolfnut",
      "version": "10.6.6",
      "rating": 3
    },
    {
      "text": "Just Google it and you'll see complaints for years with people who have requested a dark mode setting ad nauseam. Insane that they haven't included this in 2025. Will give 5 stars when they fix this issue.",
      "title": "No dark mode after years",
      "date": "2025-02-23T21:05:25-07:00",
      "user": "benchmulger",
      "version": "10.6.6",
      "rating": 1
    },
    {
      "text": "The stories and content on the app is amazing, but the app could use a dark mode. I do also wish there was a filtered search so that way I could just look at literature or just look at current politics. I have also had some issues with certain magazine issues not loading.",
      "title": "Great stories, app could be tweaked",
      "date": "2025-02-22T07:15:04-07:00",
      "user": "NolanL16",
      "version": "10.6.6",
      "rating": 3
    },
    {
      "text": "I regret my annual purchase of a digital subscription for the New Yorker. Had I been exposed to this app beforehand I would have never purchased the digital subscription. The main issue is that finding articles is basically impossible with their search function. Even when I type the title of the exact article I want to read I get search results from articles that contain any instance of any words in the title. With no sense either, it doesn’t return by most recent or closet association. Fine, I might be able to deal with that if I could at least view all works written by a particular author. But that’s not possible either. So essentially the app is a worse way to read only the most recent articles. Once they leave the Top Stories tab, good luck finding them. The web version of The New Yorker does not have these problems really. Or I can at least look at all the works of a writer. So I don’t understand why if I’m paying for the app I get a much worse experience. I suppose their digital is an afterthought, but it’s a shame. Like I said the idea of an app where I can explore all their works with ease, sounds amazing. But it’s just not the case. I won’t be resubscribing when the renewal comes.",
      "title": "Mediocre app",
      "date": "2025-02-21T23:05:37-07:00",
      "user": "0192937465",
      "version": "10.6.6",
      "rating": 2
    },
    {
      "text": "No search capability, and I’m usually stuck on whatever article loaded first. I was about to cancel my subscription over this app, but I am able to read NYer articles through my phone browser. I have to search on Google to find the articles I want! I was hoping the recent update would improve things but so far it’s the same old problems.",
      "title": "Unusable",
      "date": "2025-02-20T12:07:23-07:00",
      "user": "Monkey boys' mami",
      "version": "10.6.5",
      "rating": 1
    },
    {
      "text": "This idiotic thing has NEVER worked. I have only a digital subscription and have for years felt totally discriminated against. Confusion reigns supreme. I sometimes dream of writing a New Yorker piece absurdly how BAD its system is. I am 80 years old and have been a reader since I was 15. I wallpapered my bedroom with New Yorker covers for God’s sake!!Lived through the debacle that was Tina Brown. Now— constant new lows. People! Other publications have coped. Why Can’t You!!! We’re not in paper magazine land anymore no matter that you have 6 covers to celebrate. Such great writing if you could only get to it on line. I weep. I rage. For naught.",
      "title": "OMG",
      "date": "2025-02-20T10:18:18-07:00",
      "user": "Marycarita",
      "version": "10.6.5",
      "rating": 1
    },
    {
      "text": "Only problem is that I can’t smoothly use the Apple Music app and browse the New Yorker app at the same time. It pauses the music and messes with the widget. When using the app, the widget won’t even recognize that music was playing. I think it’s the ads that mess it up. Right now music stops as soon as I open the app and it’s quite frustrating, as I commonly read and listen to tunes simultaneously. I’m assuming it can be fixed cuz I can’t think of any other app that has this problem, and most of them are free",
      "title": "New subscriber and it’s great BUT",
      "date": "2025-02-19T14:24:25-07:00",
      "user": "Realmusic1234",
      "version": "10.6.5",
      "rating": 3
    },
    {
      "text": "I was just charged $130 for an evidently auto renewal I didn’t want. Shame on me for not reading small print, shame on The New Yorker for not sending a notification. The lack of transparency has left a really bad taste in my mouth.",
      "title": "Shady renewals",
      "date": "2025-02-19T03:06:28-07:00",
      "user": "sam in indy",
      "version": "10.6.5",
      "rating": 1
    },
    {
      "text": "I don’t usually write reviews, but sometimes there’s little choice. Obv we all love the New Yorker, but the app is bad. Gripes: (1) the authentication process is flawed. It often logs me out needlessly or requires me to login on the plane when there’s no Internet and I can’t access material. (2) I download and save magazines, but in airplane mode, it will often prevent me from accessing (the whole point of downloading articles is to use them offline). (3) I can’t listen to music (Spotify for instance) and read the magazine on my phone. Fix the above and I’m at a 5/5",
      "title": "Buggy, bad",
      "date": "2025-02-18T06:02:46-07:00",
      "user": "lightman215",
      "version": "10.6.5",
      "rating": 1
    },
    {
      "text": "it's really a basic feature to have dark mode on an app. are you trying to blind us all?! changing brightness does *not* help btw. and it shouldn't take years of our lives having to CONTINUOUSLY ASK FOR IT. before you finally implement it. we are PAYING FOR THIS, REMEMBER?????",
      "title": "do you roger",
      "date": "2025-02-17T11:40:17-07:00",
      "user": "Suzie..Oozie",
      "version": "10.6.5",
      "rating": 3
    },
    {
      "text": "Despite paying a lot of money for a subscription and despite frequent emails to The New Yorker and Kong asked, the app isn’t functional",
      "title": "Doesn’t work",
      "date": "2025-02-15T14:21:22-07:00",
      "user": "Tillbutts",
      "version": "10.6.4",
      "rating": 1
    },
    {
      "text": "If the content in the New Yorker wasn’t so worthwhile I would ditch this app in a heartbeat. - Even with the latest version it doesn’t really keep my place. If I move away from what I am reading (and the app will do it for me without asking when new stories come in), I have to scroll through the downloaded issues, remember which one I was reading, find the article, and then sometimes, but not always, it will go to where I left off: huge pain. - With one of the latest updates the cover title disappeared and the order of the articles changed (talk of the town is now at the end) - Suddenly the app started having problems with finding internet connection and issues before 2024 are not available. I hope this lasts problem is a temporary malfunction otherwise I will seriously have to cancel my subscription. BTW I have been a subscriber for many years and I would miss the magazine, just not sure it’s worth the headache. I would revert to print if I could but I travel a lot. The app, if it worked, would be a perfect solution for my needs. Too bad it doesn’t!\n\nWanted to update after the developer’s response: I have indeed contacted the technical support team several times and was appalled at the lack of resolution. For the most part it seems no one even bothers to read the requests to find out what the problems are. \nMy conclusion is the app is poorly designed and the support is lacking.",
      "title": "Desperately in need of improvement",
      "date": "2025-02-14T01:47:14-07:00",
      "user": "Weaver hollow",
      "version": "10.6.4",
      "rating": 1
    },
    {
      "text": "Would love to see dark mode in a future update of the app.",
      "title": "Almost Perfect. Needs Dark Mode.",
      "date": "2025-02-12T20:58:40-07:00",
      "user": "jholdforth",
      "version": "10.6.4",
      "rating": 4
    },
    {
      "text": "The digital subscription is not worth purchasing. The content of the magazine is excellent. Articles are interesting and well written, but if you have difficulty with your sight when using reading devices this is the worst app I’ve encountered. There is no native feature for sizing text, it says to use the device text size setting, but they don’t work. There is no dark mode that could help. There is no zoom, nothing to aid in ease of reading, which as a dedicated reading app it’s ridiculous!! It’s a shame that this app  is so inaccessible to sight challenged individuals.",
      "title": "Totally devoid of accessibility features",
      "date": "2025-02-11T08:19:03-07:00",
      "user": "LPL07",
      "version": "10.6.4",
      "rating": 1
    },
    {
      "text": "No way to increase font size.  Need larger font to be able to read.    Tried 3 times to report to tech support. Got same    Nonresponse.   Cancelling subscription even thought I LOVE the magazine— just can’t see it in this app.",
      "title": "Can’t increase font size.",
      "date": "2025-02-05T18:20:23-07:00",
      "user": "LoveTheDrama",
      "version": "10.6.3",
      "rating": 1
    },
    {
      "text": "App almost never recognizes me as subscriber, wants all info entered again. Then, when I try to access an article, it tells me my free access is over, and I need to subscribe. OR, if I‘m already a subscriber, please click here. Then the whole cycle starts anew.",
      "title": "App needs work",
      "date": "2025-02-05T14:40:45-07:00",
      "user": "District49",
      "version": "10.6.3",
      "rating": 2
    },
    {
      "text": "Similarly terrible search functionality to the NYT app. UI can be significantly improved if you allowed browsing by section. I searched “Humor” looking for the Humor section (satirical articles etc) and the first result should be Humor. Or let users navigate to that section from a menu which at least NYT app has. Please improve your UX/UI and align it with the quality of your content and subscription costs. I am a professional UX/UI designer if you want free help. Thanks.",
      "title": "Meh",
      "date": "2025-02-05T12:44:12-07:00",
      "user": "mocca827",
      "version": "10.6.3",
      "rating": 3
    },
    {
      "text": "Love the New Yorker. So much that I double checked I had the last few issues downloaded for offline reading before a 13 hour flight. Once we were in the air, I pulled out my iPad only to find that the app had somehow decided I wasn’t a subscriber and needed to sign back in, which was of course impossible as I was flying over the Pacific.\n\nThis happens from time to time, and is annoying enough when I have an internet connection, but this time was too much. \n\nPlease iron out the subscription verification system.",
      "title": "Great Content. The App Still Needs Work",
      "date": "2025-02-05T07:27:57-07:00",
      "user": "XiefeiJeff",
      "version": "10.6.3",
      "rating": 3
    },
    {
      "text": "Will you PLEASE do dark mode?!?! Everyone else has it! I can’t read you in the middle of the night when I can’t sleep because the bright screen on my iPad will disturb my husband",
      "title": "Dark mode PLEASE",
      "date": "2025-02-03T17:27:49-07:00",
      "user": "lgarner0628",
      "version": "10.6.3",
      "rating": 4
    },
    {
      "text": "Mostly very good, but there should at least be an option to include images (photography, illustrations, cartoons, etc.) when issues are downloaded. Very annoying that they’re not there when reading offline.",
      "title": "Images don’t download",
      "date": "2025-01-31T12:14:34-07:00",
      "user": "Andrew WL",
      "version": "10.6.3",
      "rating": 4
    },
    {
      "text": "if they’re Always Active? That’s Privacy No-Choice.",
      "title": "What is the point of “Privacy Choices”",
      "date": "2025-01-25T10:29:03-07:00",
      "user": "Lula P.",
      "version": "10.6.2",
      "rating": 1
    }
  ]
}